{"created_at": 1765570143.1991072, "confirmed": true, "origin": "searched", "search_input": "If computational architecture concludes with functional analysis and optimisation, it risks severing its connection to this open-ended, playful dimension. As Brian Eno states in his book *What Art Does*, *“The art engagement begins where the functional engagement ends.”* His framing is not a definition of art, but an inquiry into what art does; how it operates, resonates, and affects. This operational perspective parallels Timothy Gowers’s observation that *“a mathematical object is what it does”*. These positions suggest that both art and mathematics (fields architecture has always negotiated closely) are constituted by actions and effects, not static definitions. Applied to architecture, this implies that its capacity to think and feel through space resides less in formal analysis alone than in the way its media operate across modalities, often through affect, ambiguity, and non-linear intuition.", "suggested_query": "1.1.2 SCALES OF ARCHITECTURE BEYOND GEOMETRY The architects digital language, in other words, is not merely a tool for describing, but a tool for shaping, the very possibilities of what architecture can be. And if we are to rethink the scales of architecture beyond geometry, we must re-examine the modes of thinking, drawing, and scripting that architects employ. In this context, the notion of \"forms of life\" becomes particularly relevant. Wittgenstein's concept suggests that meaning arises not from the relationships between geometric points, but from the ways in which language is used in the context of social practices. In the same way, architectural meaning does not arise solely from the relationships between geometric shapes, but from the ways in which architects use digital tools to communicate and negotiate with clients, contractors, and users. This perspective challenges the dominant paradigm of CAD-BIM and its focus on precise, geometric representations. It opens up the possibility for architects to think about their designs as narratives, as performances, or as experiments, rather than solely as geometric structures. By acknowledging the importance of \"forms of life\" in the production of architectural meaning, we can begin to reimagine the scales of architecture beyond geometry.", "suggest_context": "1.1.2 SCALES OF ARCHITECTURE BEYOND GEOMETRY Does it ever occur to us that the language that architects read and write can itself be altered and rethought?... Might not the limits of the spatial notation currently in use impose limits on the architecture that architects are capable of creating? This reflection, posed by doubleNegatives Architecture after echoing Wittgensteins famous assertion that The limits of my language mean the limits of my world, forms the terrain of this section. The previous section described how the CADBIM and digital-twin regime elevates Cartesian geometry into the primary carrier of architectural information. If the limits of an architects digital language are shifting toward this geometrical centre, then we must ask what modes of architectural thinking are being excluded. This is not merely a philosophical worry; it is a practical and epistemic concern. Wittgensteins own trajectory is instructive. In the Tractatus, language is pictured as a logical mirror of the world: a proposition represents a possible state of affairs. The later Philosophical Investigations re-evaluates this picture in favour of language-games, where meaning is what words do in use, embedded in \"forms of life\". A BIM model belongs very clearly to the first stance: it is a picture of a building, articulated as a totality of facts. Architectural practice, however, behaves much more like Wittgensteins later language-games: drawings, models, texts, films and conversations do not simply mirror a building; they continuously renegotiate what it is, as it is designed, discussed, and inhabited. The question is thus not whether geometry is necessary, of course it is, but what happens when an entire digital ecology is organised as if architecture were only what can be pictured in this way. From its origins, architecture has demanded a synthetic intelligence; one that navigates and negotiates between modes of thinking, drawing, modelling, scripting, narrating. As we have seen in the work of Vitruvius, Alberti, Tschumi, Ando, Koolhaas and Ishigami, architecture arises through the tensions and resonances between different kinds of concerns, interests and domains of content. Studio practice relies on a navigation through abundance: models, drawings, texts and references linger, are re-seen and re-read over time. This multimodal capacity sustains architectures discursive and speculative scope. In the contemporary digital condition, this abundance is amplified by the global network Jorge Orozco Esquivel describes: information circulates ad infinitum and objects are characterized from many indexes rather than by single definitions. What are the consequences when the qualitative, the speculative, and the non-geometric dimensions of architecture lose their footing in computational discourse?"}