{"created_at": 1766093817.538715, "confirmed": true, "origin": "searched", "search_input": "", "suggested_query": "As this instrumentality unfolds, it will become evident that the distinction between text and image, or between plan and section, is not a matter of representation but rather an architectonic obstacle that structures thought. The machine learning models employed here are not intended to dissolve this difference but rather to establish a novel kind of resonance between domains. By doing so, they enable a reading of architectural concepts that is both non-linear and contingent, always dependent on position and context.", "suggest_context": "Models are not mirrors but devices: they create conditions under which relations can appear, be measured, and be transformed. Measurement still matters, but it may run along axes of probabilities, proximities, and indices, rather than along classical notions of correctness or exactitude. The ambition pursued here is to treat digital models in precisely this way: as architectonic instruments that facilitate reading, and re-reading, relations between heterogeneous communications. We treat the persistent difference between text and image as an architectonic obstacle that can structure thought, akin to the way perspective constructs a view by lawful distortion, always dependent on position. Throughout machine learning is relied on to establish projections between domains, with emphasis on the non-linear but contingent nature of such projections, while resisting the temptation to align away difference. Methodologically, the work draws on computer science, mathematics and architectural theory to prototype alternative encodings and projections: algebraic rather than purely logicist; communicative rather than solely procedural. This stance situates architectural computation within a broader, contemporary paradigm of communication and self-organisation. The instrumentality of the thesis, writing as device, device as writing, follows a lineage of informational instruments that articulate libraries, images, and concepts into operable constellations developed at the Chair of Digital Architectonics at ETH in Zrich. The immediate concern is not to predict architecture from data, but to restore architectonic play between media: a space where theory, atmosphere, culture, and association can once again act with design. To frame the discussion on how such an instrument takes shape, several key terms are introduced here with specific meanings. Projection refers to the transposition of information from one representational domain into another, following a lineage from Albertis perspectival mappings to contemporary computational models; it always involves distortion and re-proportioning rather than equivalence. Proportion denotes the qualitative calibration of distinct modalities such that their differences remain generative, akin to Vitruvian harmony, and is contrasted here with translation, which implies semantic sameness. Architectural modes of communication is used to refer to any media through which architectural concepts are conveyed, spanning the diversity of traditional and digital media - plans, sections, renderings, physical models, diagrams, texts, images. Cast is used by analogy with material casting, where one substance gains form through the imprint of another, here designating how one modality can structure the expression of another. Resonance describes a mode of correspondence between modalities that operates beyond statistical similarity, emphasising experiential, cultural, and contextual dimensions: the capacity of an artefact in one domain to evoke or activate meaning in another without collapsing their formal distinction. Finally, Architectonic Instrument names a construct - material, digital, or conceptual - that enables the articulation and interrogation of architectural ideas across domains. In this context, machine learning models are treated as architectonic instruments when they sustain heterogeneity and enable cross-modal reasoning. These terms are expanded in the discussion that follows, introduced here for clarity. With this ambition and vocabulary in place, the remainder of the chapter specifies the scope of the thesis and articulates its proposal ."}