{"created_at": 1766152996.428855, "confirmed": true, "origin": "searched", "search_input": "Multimodality in the context of architecture can therefore be understood as a structuring condition of architectural thought, more complex than as a simple coexistence of domains. Each mode - plan, section, model, image, text - carries its own semiotic logic and operational affordances. Rather than dissolving into a unified representation, these modalities sustain architectural reasoning through their interplay and disjunction. As Gunther Kress argues on multimodality in the process of learning in general, each mode brings distinct potentials shaped by its material and cultural history: *\"While speech is based on the logic of time, (still) image is based on the logic of space. [...] In image, meaning is made by the positioning of elements in that space; but also by size, colour, line and shape. Image does not ‘have’ words; it uses ‘depictions’. Words can be ‘spoken’ or ‘written’, images are ‘displayed’. [...] Meaning relations are established by the spatial arrangement of entities in a framed space and the kinds of relation between the depicted entities.\"* In architecture, this supports the notion that drawing, modelling, writing, and narration do not overlap but align momentarily through acts of design. The architect’s work lies in composing their proportionality, producing meaning by exploring the resonances and tensions that emerge across modes, an operation that extends beyond that of translating between the different notations of geometry. Modalities define not only what is represented but how thought itself is organised and communicated. This orchestration extends into communication and discourse as well. The architectural project is not finished when built; it is continuously mediated through publications, exhibitions, arguments, and critique; each constituting yet another modality.", "suggested_query": "The architectural project's multimodality is exemplified in the way it navigates the interstice between the abstract and the concrete, between the theoretical and the practical.  In this liminal space, architects orchestrate an intricate dance of representational modes, constantly reconfiguring the relationships between plan, section, elevation, and text. The architect's task is to distill the essence of the design into a coherent narrative, one that balances the competing demands of spatial logic, material constraints, and aesthetic considerations.  By doing so, the architect not only shapes the built environment but also forges a unique language that communicates the design's intent and potential to others.", "suggest_context": "While architects are connoisseurs of spatial containers, the art of making the volume inside those containers is one that, surprisingly, is rarely discussed. ... Despite the pleasure associated with volume, the discipline has not developed, in hundreds of years of space making, an artful, technical, practical, or even silly vocabulary for describing it. - Koolhaas, Elements of Architecture Exactly because of this lack of direct vocabulary, architectural space does not appear independently of its representations but emerges from their interplay. A plan cannot be derived from a section, nor vice versa; each outlines a different set of spatial relationships, of priorities and abstractions. Plans, or ichnographic projections, establish relational fields, mapping circulation and zoning across the ground plane. Sections, as orthographic cuts, organize vertical stratifications, registering gravity and material accumulation. Scenographic views - elevations, perspectives, and renderings - engage with spatial appearance and performativity. Textual briefs and conceptual diagrams enter this constellation as propositional instruments, inscribing programs, narratives, or theoretical vectors. Each modality draws upon a different register of space. They do not reinforce a singular architectural truth but construct a dispersed and dynamic matrix of interpretations and operations. This disjuncture opens architecture to interpretation, negotiation, and invention. It is through their tension that space is circumscribed. Multimodality in the context of architecture can therefore be understood as a structuring condition of architectural thought, more complex than as a simple coexistence of domains. Each mode - plan, section, model, image, text - carries its own semiotic logic and operational affordances. Rather than dissolving into a unified representation, these modalities sustain architectural reasoning through their interplay and disjunction. As Gunther Kress argues on multimodality in the process of learning in general, each mode brings distinct potentials shaped by its material and cultural history: \"While speech is based on the logic of time, still image is based on the logic of space. ... In image, meaning is made by the positioning of elements in that space; but also by size, colour, line and shape. Image does not have words; it uses depictions. Words can be spoken or written, images are displayed. ... Meaning relations are established by the spatial arrangement of entities in a framed space and the kinds of relation between the depicted entities.\" In architecture, this supports the notion that drawing, modelling, writing, and narration do not overlap but align momentarily through acts of design. The architects work lies in composing their proportionality, producing meaning by exploring the resonances and tensions that emerge across modes, an operation that extends beyond that of translating between the different notations of geometry. Modalities define not only what is represented but how thought itself is organised and communicated. This orchestration extends into communication and discourse as well. The architectural project is not finished when built; it is continuously mediated through publications, exhibitions, arguments, and critique; each constituting yet another modality."}