{"created_at": 1766097612.120985, "confirmed": true, "origin": "searched", "search_input": "If something is put through computation, with the Turing machine as the archetypical machine, it must be encoded. Represented as 1s and 0s. Flattened into the binary. This however does not *necessarily* mean the artefact is flattened in itself; the flattening becomes an issue when the encoding is treated as a definition of the object. This could be the case with the 3D model and the digital twin if architecture is presumed to have *become* the model, totally represented through its geometric and informational surrogate. In the same fashion, any one perspective image through Alberti’s technics of perspective becomes, in its communication, a flattened index. But the art of architecture is that the comprehension of space exists through the proportion between different modes of communication. This is also why Ada Lovelace remains a key reference point. Her insight for the potential of numerical encoding to offer another space to think in. One that remains an instrument, but not a predetermined one. The thesis keeps the binary substrate (1s and 0s) in view as an addressing system: a condition for operations.", "suggested_query": "The editor, as an operational environment, is designed to handle the complexity of these operations. It is a tool that enables the researcher to navigate the back-and-forth between the different domains of texts and images, and to project and recompose the artefact in different ways. The design of the editor is informed by the theoretical argumentation, which supports the reasoning for this stance. The work therefore treats writing itself, and to a lesser extent the curation of image constellations, as modes of architectonic operation. In this way, the research procedure can be seen as an iterative process, where the artefact is constantly being re-encoded and re-projected, and the researcher is constantly negotiating between different modes of communication. The editor is not just a tool for creating and editing digital information, but also a means of understanding and manipulating the artefact as a complex system of relationships between different elements. This approach allows for a more nuanced understanding of the artefact, and enables the researcher to explore new possibilities for the representation and communication of the artefact.", "suggest_context": "1.2.1 SCOPE The scope of this thesis is to apply an architectural attitude to digital information. This means the thesis is not so much directly engaging with architecture as an object, but rather with the processes that lie at the basis of architectural projects: how architecture thinks, communicates, and negotiates between heterogeneous modes. The project pursues architectural method as a transferable discipline of mediation, an art of placing different information and contents into proportion. Because the research is pursued through an instrument developed alongside it, the scope revolves around the design of an editor in which the thesis is written and tested as an operational environment, with the theoretical argumentation supporting the reasoning for this stance. The work therefore treats writing itself, and to lesser extent the curation of image constellations, as modes of architectonic operation: a back-and-forth between domains of texts and images, actively handled, queried, projected, and recomposed as part of the research procedure. If something is put through computation, with the Turing machine as the archetypical machine, it must be encoded. Represented as 1s and 0s. Flattened into the binary. This however does not necessarily mean the artefact is flattened in itself; the flattening becomes an issue when the encoding is treated as a definition of the object. This could be the case with the 3D model and the digital twin if architecture is presumed to have become the model, totally represented through its geometric and informational surrogate. In the same fashion, any one perspective image through Albertis technics of perspective becomes, in its communication, a flattened index. But the art of architecture is that the comprehension of space exists through the proportion between different modes of communication. This is also why Ada Lovelace remains a key reference point. Her insight for the potential of numerical encoding to offer another space to think in. One that remains an instrument, but not a predetermined one. The thesis keeps the binary substrate 1s and 0s in view as an addressing system: a condition for operations."}