{"created_at": 1764007952.502124, "confirmed": true, "origin": "searched", "search_input": "", "suggested_query": "The projection from multimodal to figurative, on the other hand, will be the most productive one within the text editor, as it directly enables the transformation of multimodal documents into textual representations. This transformation will be demonstrated using the 216 film corpus, where the multimodal documents will be projected onto the textual domain to generate a textual representation of the multimodal content. This projection will be used as a basis for the operative projections within the text editor, which will be discussed in the following sections.", "suggest_context": "3.5 PROJECTIONS This chapter will go through all operations that are defined within and between the domains described thus far, which we will refer to as projections. While more operations are in principle possible within the setup of the instrument, we will restrict ourselves to the ones that are facilitated within the text editor, with some specific additions that will be used for the chapter 4 instances. Each projection will be characterised first of all by its domain and co-domain, then we will specify the used encoding method according to the description given in 3.3. From here we describe the computational equation used between these. Finally each will be demonstrated with one or more examples. Instead of following the order of the previous chapters where we first started at the public to then go to the private domains, we will now start with the private multi-modal domain and then end with the public single-modality domains. MULTIMODAL First the projections internal to the multimodal domain, here again relying on the 216 film corpus to demonstrate the operations. MULTIMODAL rightarrow text First we will look at the projections that have the multimodal documents as the domain with the textual domain of the multimodal corpus as its co-domain. The outcome of these projections onto the textual screen has already been shown in figure 3.4:9. Because the multimodal documents are also what constitutes the dimensions of the multimodal encodings, this projection can be more understood as an investigation of the space within which the textual domain is defined rather than an immediately productive one. Therefore it also doesn't directly feature in the operative projections within the text editor, but it will give us an insight into the constitution of the multi-modal cast we rely on, together with the projection from multimodal to figurative that we will also discuss next."}