{"created_at": 1763995690.745409, "confirmed": true, "origin": "zotero", "search_input": "Both of the multi-modal screens sit within the dimensions corresponding to the multi-modal documents that make up the domain. As an example we will describe the multi-modal structure based on the 216 films described in 3.3. However any other collection of multi-modal documents as described in 3.3 would follow the same process in establishing the 2 operative screens.", "suggested_query": "...the textual and figurative domains, we can explore the relationships between them. To do so, we will compute the cosine similarity between the SOMs of both domains for each film. This will give us an idea of how similar the textual and figurative representations are for each film. The resulting similarity matrix will be a powerful tool for understanding the structure of the multi-modal domain, as it will allow us to identify clusters of films that share similar textual and figurative characteristics. We can then use this information to inform the design of the multi-modal screens, allowing us to create a more nuanced and accurate representation of the domain.", "suggest_context": "- So although it might read like we criticise CLIP in chapter 2, it is not a criticism on it as a tool, it is incredible in it's translational capacities. It's just that we'd like to think about the relation between text and image as a richer ground than just that of description, which is why we're eagerly working with CLIP in order to expose these other proportionalities. MULTIMODAL Both of the multi-modal screens sit within the dimensions corresponding to the multi-modal documents that make up the domain. As an example we will describe the multi-modal structure based on the 216 films described in 3.3. However any other collection of multi-modal documents as described in 3.3 would follow the same process in establishing the 2 operative screens. word Figure 3.4:8 - SOM of the 216 dimensional textual domain of films click to see large pdf. For the textual domain we will rely on the vectors wtF based on the subtitles of each film as described in 3.3. These vectors with the co-occurence nudge are the material for training a toroid SOM of 35x60 cells. A toroid SOM was chosen here because the legibility in a 2D format was deemed important in accordance with the ambition of a simultaneous reading of domains as explained in 2.4. The resulting screen is a populated grid of 2,100 cells with the 12,934 words from the mm216vocabt shown in figure 3.4:8. Activating the textual screen on each dimension, corresponding to a film each, gives us an insight to the different characteristics and emphasis that each film puts within the textual domain, shown in figure 3.4:9. Figure 3.4:9 - SOM of the 216 dimensional textual domain of films click to open full scale image. word Figure 3.4:10 - SOM of the 216 dimensional figurative domain of films click to see large pdf. For the figurative domain we follow the same topology and size as the textual domain to train a figurative SOM on the wfF vectors. The resulting screen is a figurative counterpart to the textual screen. A populated grid of 2,100 cells with the 16,996 words from the mm216vocabf shown in figure 3.4:10. Activating the figurative screen on each dimension, corresponding to a film each, gives us an insight to the different characteristics and emphasis that each film puts within the figurative domain, shown in figure 3.4:11."}