{"created_at": 1766156673.3382342, "confirmed": true, "origin": "searched", "search_input": "The point of this comparison is not that the model “understands” gardens, nor that it reliably detects culture. It is that the embedding space behaves like an environment in which similarity is produced as a consequence of training, framing, and the operative priors of the model. The interest is not the correctness of any single resemblance, but the form-taking of resemblance itself. A similarity score on its own is the view from a perspective that “stays outside” and only checks what goes in and what comes out. Architectonically our interest lies in the interior of the domains in which the resemblances take shape: the mould in which it takes form.", "suggested_query": "The CLIP model's encoding of gardens as a shared vector space offers a unique opportunity to explore the relationship between geometry and culture. While the model may struggle to distinguish between the Ryoan Ji and the Mediterranean garden based on their material and geometric properties, it is precisely in the divergences between the three images that we can begin to uncover the cultural and affective resonances of each garden. The model's inability to fully capture the cultural difference between the Ryoan Ji and the Mediterranean garden highlights the need for a more nuanced understanding of the relationships between geometry, culture, and computation. By examining the ways in which the CLIP model produces and mediates these relationships, we may uncover new possibilities for architectural design and computation that move beyond the simplifications of traditional parametric systems. In this sense, the CLIP model can be seen as a tool for exploring the complex, multimodal relationships between architecture and culture, and for developing new methods for designing and representing the built environment.", "suggest_context": "ON DIGITAL MULTIMODALITY Contemporary computational design tools have undoubtedly changed the way in which architects develop projects, both adding precision and coordination to architectural practice. Yet this very structuring power often flattens the epistemic richness that architectural multimodality affords. Systems like Revit and Grasshopper reduce architectural representation to interoperable geometries and quantifiable parameters. As Marini critiques, architectural computation has historically evolved through simplification within existing models, translating architectural thought into parametric control systems, where design becomes the manipulation of variables. He notes that due to their overemphasis on geometry, such systems marginalise modes of thinking that resist formalisation; the speculative, discursive, and affective potentials of architecture. A parallel flattening occurs in contemporary multimodal machine learning models. Systems such as CLIP embed images and texts into a shared vector space, aligning them under the premise that they express commensurable content. Trained on the one-to-one correlation of description as distance measure. Yet this assumption of correlation runs counter to the architectural condition. The value of plans, sections, renderings, and descriptions lies in their divergence, their capacity to circumscribe space through disjunct but interdependent logics. Rather than aiming for alignment, the architectural lesson is that such divergence is precisely what affords conceptual richness. When turning to CLIP, then, the question is whether such divergence can be reintroduced into its collapsed space between image and text; modalities that in architecture permit fundamentally different contributions to the concepts they engage. That is not to say such models do not bear great potential to facilitate qualitative instrumentalisations. Rather, it is to insist that their value lies in how they can be operated without mistaking their outputs for equivalence. A simple example that demonstrates the potential of computation and particularly ML beyond that of geometrical aspects but towards cultural qualities is to take three images of gardens - Ryoan Ji in Kyoto, Sankei En in Yokohama, Mediterranean Garden in Dyffryn Gardens, UK - and encode them using the CLIP model. Even though the Ryoan Ji and the Mediterranean garden photos might show more resemblance in terms of material, scene, and geometry - both have a ground of gravel, dotted planted elements and a wall backdrop - the Mediterranean garden has a lower similarity to both other images, demonstrating a sensibility to the cultural dimension Fig. 2.2:1. Figure 2.2:1  Cosine similarity between garden image embeddings using CLIP. The point of this comparison is not that the model understands gardens, nor that it reliably detects culture. It is that the embedding space behaves like an environment in which similarity is produced as a consequence of training, framing, and the operative priors of the model. The interest is not the correctness of any single resemblance, but the form-taking of resemblance itself. A similarity score on its own is the view from a perspective that stays outside and only checks what goes in and what comes out. Architectonically our interest lies in the interior of the domains in which the resemblances take shape: the mould in which it takes form."}