{"created_at": 1763169310.4576871, "confirmed": true, "origin": "searched", "search_input": "An alternative multi-modal type of document are PDFs that contain a substantial number of images. Here there is less of a personal view, but rather these data collections aspire to demonstrate the ability to foster projections tuned to a specific discourse. Another demonstrative aspect of this type of data in contrast to films is to test how the developed method performs when applied to multi-modal documents that are richer in textual density than film, but comparatively sparse in the figurative domain.", "suggested_query": "The PERSONALPRIVATE MULTI-MODAL It is dominated by a philosophy of order, neighbourhood, and situs; at the same time as it dominates a technique of measurement, it gives rise to an analysis of position; at the same time as it is an evaluation of quantity, it provides the principal method for applying the finite to the infinite, or the infinite to the finite  - whether we expand or sum; it is the infrastructure of calculation having measurement as a result and order as a condition; it finally allows us to talk about space, in differential geometry, but it constitutes it through tabulation.  The datasets that will establish these multi-modal casts are therefore deliberately small in comparison to the PUBLIC domains and are intentionally partial. Their selection reflects a sensibility: not neutral sampling but situated, authored choices that enable a tuning between text and image distinct from, and in proportion to, the generic screens introduced above.  The second corpus, MUSIC, consists of song lyrics with metadata. Music provides another naturally occurring multimodality: a continuous audio stream articulated as tracks and a co-present narrative channel articulated as lyrics. We constrain the textual side to song lyrics without metadata or editorial commentary; the two channels are retained as co--present but non-equivalent: timecodes allow adjacency", "suggest_context": "Operationally, our use requirements are modest: we require scale, licence clarity, stable availability, and a compact metric for imageimage relations. PD12M satisfies the first three directly, and the fourth through its per-image CLIP vectors, which will be mobilised later on to stage adjacency and proportion within the image field. the PERSONALPRIVATE MULTI-MODAL It is dominated by a philosophy of order, neighbourhood, and situs; at the same time as it dominates a technique of measurement, it gives rise to an analysis of position; at the same time as it is an evaluation of quantity, it provides the principal method for applying the finite to the infinite, or the infinite to the finite - whether we expand or sum; it is the infrastructure of calculation having measurement as a result and order as a condition; it finally allows us to talk about space, in differential geometry, but it constitutes it through tabulation. - Michel Serres, Le Systme de Leibniz et Ses Modles Mathmatiques. As established in the first two chapters, the ambition is to establish projections between modalities and to demonstrate that such projections can be made specific, personal, and curated. The datasets that will establish these multi-modal casts are therefore deliberately small in comparison to the PUBLIC domains and are intentionally partial. Their selection reflects a sensibility: not neutral sampling but situated, authored choices that enable a tuning between text and image distinct from, and in proportion to, the generic screens introduced above. 1. FILM The first corpus consists of films with subtitles. Films provide a naturally occurring multimodality: a continuous image stream articulated as frames and a co-present narrative channel articulated as subtitle text. We constrain the textual side to non-descriptive subtitle tracks to foreground dialogue rather than editorial commentary; sound-effects glosses and descriptive inserts are excluded. The two channels are retained as co-present but non-equivalent: timecodes allow adjacency without presuming that words describe images or vice versa. The working collection comprises 215 films. At times subsequent chapters operate on smaller, thematically cohesive subsets e.g., a single director or studio. The selection is intentionally personal; it reflects a preference for films I have watched and value, with a bias toward aesthetic and historical interest. The point is not canonization but tuning: this corpus sets the figurative and narrative register against which projections into the generic IMAGE and TEXT domains can be proportioned. Another viewers corpus would tune the instrument differently and thus produce a distinct proportionality. Operationally, films enter the instrument as: i dialogue text normalized subtitle lines with timestamps and ii time-indexed frames sampled sparsely to register scenographic change rather than to exhaust motion. Crucially, no attempt is made to collapse one channel into the other; adjacency is staged, not asserted as equivalence. Later chapters will mobilise this material to derive figurative concepts that orient image search and composition across the generic domains, while keeping the multi-modal gap intact."}