{"created_at": 1765638947.781444, "confirmed": true, "origin": "searched", "search_input": "The brief outline of different directions of computational encodings above is intended to show the direct context of this thesis, what it draws from and where it approaches these issues differently. Finally, it is necessary to briefly situate how related questions have been addressed in the immediate environment within which this work was developed: the Chair for Digital Architectonics at ETH Zürich. The chair sets out from the principle of treating architecture and information technology as mutually informing practices rather than separate domains. In *EigenArchitecture: Computability as Literacy*, Ludger Hovestadt characterises it as *“an interplay between two species similar in kind, neither of them being in the least disciplinal: both affect everything, both are arts of gathering things.,”* introducing a stance in which architects learn to operate with eigenvectors, populations and symbolic abstractions rather than single ideal objects. In the first volume of *On Digital Architecture*, Hovestadt similarly presents the work as a *“body of thinking”* that gives the public a face and calls on architects *“to learn to read and write… to become literate in the digital, not primarily to get fluent in using digital tools, but to be able to talk about the digital profoundly.”* Within this environment, computation is approached as a way of thinking with information and of constructing architectonic instruments that can hold together heterogeneous scalarities, rather than as a specialised technique for optimising form.", "suggested_query": "", "suggest_context": "Meaning is not stored as a fixed entry in a lexicon, but emerges from position in a field of differences. This non-formalist stance extends to multimodal models like CLIP, where images and captions are mapped into a shared vector space and associated by proximity. Such systems work not by following specified rules about what an architectural faade or a public square is, but by internalising a vast, probabilistic sense of how such phrases and images tend to appear together. Mario Carpo has argued that digitally made objects are increasingly identified not by visual resemblance, but by the recognition of hidden patterns, on computational algorithms, or on other nonvisual features. In his example of credit cards, visual inspection gives way to algorithmic verification; authenticity becomes a function of a numerical sequence rather than an image. This shift from surface resemblance to encoded pattern is precisely what contemporary multimodal models operationalise. They do not simply store a geometric model or a textual description; they internalise correlations across billions of tokens and pixels. Architectural drawings, texts and photographs become points in such a space, linked by similarities that often exceed what a designer consciously specifies. This introduces a new kind of non-calculable. Where formal languages promise symbolic transparency at the cost of combinatorial tractability, and soft machines promise adaptability at the cost of explicit structure, contemporary models offer powerful pattern-recognition at the cost of interpretability. Their knowledge takes the form of distributed statistical structure, accessible only indirectly through prompts, projections and probes. Digital architectonics The brief outline of different directions of computational encodings above is intended to show the direct context of this thesis, what it draws from and where it approaches these issues differently. Finally, it is necessary to briefly situate how related questions have been addressed in the immediate environment within which this work was developed: the Chair for Digital Architectonics at ETH Zrich. The chair sets out from the principle of treating architecture and information technology as mutually informing practices rather than separate domains. In EigenArchitecture: Computability as Literacy, Ludger Hovestadt characterises it as an interplay between two species similar in kind, neither of them being in the least disciplinal: both affect everything, both are arts of gathering things., introducing a stance in which architects learn to operate with eigenvectors, populations and symbolic abstractions rather than single ideal objects. In the first volume of On Digital Architecture, Hovestadt similarly presents the work as a body of thinking that gives the public a face and calls on architects to learn to read and write to become literate in the digital, not primarily to get fluent in using digital tools, but to be able to talk about the digital profoundly. Within this environment, computation is approached as a way of thinking with information and of constructing architectonic instruments that can hold together heterogeneous scalarities, rather than as a specialised technique for optimising form."}