{"created_at": 1762956213.2798662, "confirmed": true, "origin": "searched", "search_input": "The Writing Images and Picturing Text editor (WIPTe) forms the primary subject of this thesis, as well as its operation and context. The primary focus in constructing this multi-modal instrument together is to facilitate a constant setting within which this thesis is to be written. Therefore turning on itself both as an outline of what it is proposing as a research direction, all the time whilst demonstrating the outcome of its own question, simultaneaously. Therefore it was deemed of importance that WIPT was finished before the final writing stage. This chapter will go through all of the steps of its implementation, whilst continuing to be accompanied by the imagery and textual contexts it puts forward.", "suggested_query": "For WIPTe, I have developed a set of guidelines that outline the process of creating and editing the visual and textual components of the instrument. These guidelines serve as a framework for the researcher to work within, allowing for the creation of a cohesive and well-structured document. The guidelines include suggestions for the selection and arrangement of images, the use of color and font, and the integration of text and image. Additionally, I have included a section on the importance of context and the role of the researcher in the creation of the instrument. By following these guidelines, the researcher can ensure that their WIPTe is both visually and textually appealing, and that it effectively communicates the intended message.", "suggest_context": "3. TEXT EDITOR Companions: 3. Derridas Take on Texts For Derrida, a text isnt limited to books or writingits anything that can be interpreted e.g., art, culture, speech. He suggests:  There is no outside-text Il ny a pas de hors-texte. This phrase from Of Grammatology 1967 doesnt mean nothing exists outside of language but that we only access reality through language, which shapes and limits our understanding. The Writing Images and Picturing Text editor WIPTe forms the primary subject of this thesis, as well as its operation and context. The primary focus in constructing this multi-modal instrument together is to facilitate a constant setting within which this thesis is to be written. Therefore turning on itself both as an outline of what it is proposing as a research direction, all the time whilst demonstrating the outcome of its own question, simultaneaously. Therefore it was deemed of importance that WIPT was finished before the final writing stage. This chapter will go through all of the steps of its implementation, whilst continuing to be accompanied by the imagery and textual contexts it puts forward."}