{"created_at": 1765570050.241673, "confirmed": true, "origin": "searched", "search_input": "", "suggested_query": "The CADBIM and digital-twin regime has not only elevated Cartesian geometry but also reinforced the notion that architecture can be reduced to a set of spatial and geometric facts. This reduction, however, does not account for the complex, dynamic, and contextual nature of architectural design and practice. The language of BIM models and digital twins is not well-suited to capture the nuances of architectural thinking, which involves a constant negotiation of meaning and context. This is not to say that geometry is not important but rather that it is just one aspect of the complex web of relationships that constitute architectural thinking and practice. As such, it is essential to re-evaluate the limits of our digital language and explore new modes of thinking that can accommodate the complexities of architectural design and practice.", "suggest_context": "1.1.2 SCALES OF ARCHITECTURE BEYOND GEOMETRY Does it ever occur to us that the language that architects read and write can itself be altered and rethought?... Might not the limits of the spatial notation currently in use impose limits on the architecture that architects are capable of creating? This reflection, posed by doubleNegatives Architecture after echoing Wittgensteins famous assertion that The limits of my language mean the limits of my world, forms the terrain of this section. The previous section described how the CADBIM and digital-twin regime elevates Cartesian geometry into the primary carrier of architectural information. If the limits of an architects digital language are shifting toward this geometrical centre, then we must ask what modes of architectural thinking are being excluded. This is not merely a philosophical worry; it is a practical and epistemic concern. Wittgensteins own trajectory is instructive. In the Tractatus, language is pictured as a logical mirror of the world: a proposition represents a possible state of affairs. The later Philosophical Investigations re-evaluates this picture in favour of language-games, where meaning is what words do in use, embedded in \"forms of life\". A BIM model belongs very clearly to the first stance: it is a picture of a building, articulated as a totality of facts. Architectural practice, however, behaves much more like Wittgensteins later language-games: drawings, models, texts, films and conversations do not simply mirror a building; they continuously renegotiate what it is, as it is designed, discussed, and inhabited. The question is thus not whether geometry is necessary, of course it is, but what happens when an entire digital ecology is organised as if architecture were only what can be pictured in this way."}