{"created_at": 1766455737.590441, "confirmed": true, "origin": "searched", "search_input": "Our screens align with the projection surface Serres describes in his discussion on the way Leibniz achieves a formal analysis of representation, designed to keep correspondences legible under changes of projection surface. It fixes indices (what can be addressed), supplies a compact metric (how things can touch), and offers a plane where proportions can be cast without collapsing modalities into translation. In the **PUBLIC** screens (books, images) the surface remains generic and tends towards observation. In the *PRIVATE* screens (multimodal text-words, figurative-words) the surface is biased on purpose, an authored cast that curates attention. Together they coexist without collapse: shared dimensionality, different information.", "suggested_query": "The screen's addressability is not an addressable point in the domain, but a low-dimensional surface, a flat domain in itself, onto which projections can be cast. This surface, though flat, is not a one-to-one mapping, but rather a diffracting medium that allows projections to be refracted, their differences preserved, and their commonalities revealed. In this way, the screen enables the discernment of patterns across the domain, patterns that would otherwise be lost in the noise of the full dimensionality of the domain.  In the case of the WIPTe framework, these patterns are the result of the Self-Organising Maps, or the word-indexed database surfaces, that provide a means of navigating and understanding the complex relationships within the domain. The screen thus becomes a tool for exploration, a means of entering the domain and uncovering its secrets.  With the screen as a tool, the researcher can move from the periphery to the center of the domain, and from the surface to the depth, gaining a deeper understanding of the relationships that underlie the domain.", "suggest_context": "3.4 CONSTRUCTING THE DOMAIN STRUCTURES \"Fortunately, our purposes do not entail knowing Chinese thought extensively, an endless enterprise requiring two lifetimes, but something else entirely: only crossing a threshold and entering.\" - Jullien, The Book of Beginnings  Like Jullien's statement on the Chinese thought, the goal here is not to know the full extent of the domains we engage with, but to find ways of entering. This chapter establishes the instruments for this entering: the screens between which projections are cast. We adopt the term screen to describe a low-dimensional, addressable field, an instrument rather than a representation, that lets a whole domain be handled at once. In WIPTe, screens are built either as Self-Organising Maps SOMs or, for the GENERIC FIGURATIVE domain, as a word-indexed database surface. They are screens because they are designed to receive and diffract projections across the domain while preserving differences in kind: PUBLIC screens books, images are generic and observational; PRIVATE screens multimodal text-words, figurative-words are deliberately biased and personal. Together they operate orthogonally shared measures, different information so that the operation between them is proportion rather than translation. The two PUBLIC screens can also be seen as the observational substrate, while the PRIVATE screens act as the projective instruments through which the different observations are refracted onto a spectrum of observations of the other public screen - more like a prism than a mirror. 3.4.1 INFORMATIONAL SCREENS Screens provide a constructed field for projection: a low-dimensional, addressable surface that lets a whole domain be handled at once. Not a picture, but an instrument, like the silver screen in a cinema is a host for the film projector. \"The point-by-point correspondence of the solid volume and its delineation, ichnography or scenography, makes the latter a characteristic or a language; conversely, language establishes a correspondence of the same type as the painting - one then understands the deformations and avatars of the former, if one observes that the projection can be made on a left surface, or 'humpbacked'\" - Serres, Le systme de Leibniz et ses modles mathmatiques Our screens align with the projection surface Serres describes in his discussion on the way Leibniz achieves a formal analysis of representation, designed to keep correspondences legible under changes of projection surface. It fixes indices what can be addressed, supplies a compact metric how things can touch, and offers a plane where proportions can be cast without collapsing modalities into translation. In the PUBLIC screens books, images the surface remains generic and tends towards observation. In the PRIVATE screens multimodal text-words, figurative-words the surface is biased on purpose, an authored cast that curates attention. Together they coexist without collapse: shared dimensionality, different information."}