{"created_at": 1766458499.996448, "confirmed": true, "origin": "searched", "search_input": "This projection is thus a two-stage proportioning: first by weighted overlap to secure relevance, then by quota-constrained gains to keep the list variegated across the input vocabulary, producing a compact legible image constellation around the words rather than a repetitive cluster. Because the searches are acknowledged to always be partial they bring a further insight into the figurative screen as to which sorts of figurative features are brought to the foreground through their presence alongside the aspects by which they were projected.", "suggested_query": "The final shortlist I  i1,...,iK is computed by iterating K times. For each iteration, we pick the image with the highest Ji  and incrementally update Gi and hatoi for the remaining candidates. The greedy selection process ensures that each term in the input vocabulary can only \"help\" at most q selections, thereby controlling the diversity of the final shortlist. The output is a ranked set of images that balance raw overlap strength with the need to explore the vocabulary, effectively capturing a figurative screen that is both relevant and varied.", "suggest_context": "Sort by oi and keep a candidate pool of size P  maxK  eta, Pmin, where K is the intended final number of image results default 20, eta is a factor default 40, and Pmin is a set minimum default 2000. This pooling step is designed to be cheap: it avoids building per-image lists until the pool is already small. The pooled candidates are all relevant, but many will be relevant in the same way dominated by a subset of the input labels. To avoid a shortlist that over-serves a few terms, we enforce a per-term quota: q au  q in mathbbN meaning that each term is allowed to \"help\" at most q selections. Let usesLeft au track remaining uses. For each pooled image i, retain its overlapped term set Ti   au in T :ci, au  0 We then define a dynamic gain that only credits terms that still have quota remaining: Gi  sum au in Ti : usesLeft au  0 omega au The selection objective mixes this breadth term with the base overlap score: Ji  lpha Gi  1-lphahatoi  where lpha in 0,1 trades diversity against raw overlap strength, and hatoi is the current static score contribution. In the simplest case hatoi  oi, but the implementation optionally masks static contributions from terms once they have been spent: - : never mask oi always counts fully - : mask a term's static contribution after it is credited the first time. - : mask only when a term has reached quota - when usesLeft au0 Now that the pool images have been given a value, we do a greedy selection process from the candidate pool, K times: 1. pick i  argmaxJi among remaining candidates 2. for each  au in Ti with usesLeft au0, decrement usesLeft au leftarrow usesLeft au -1 3. update Gi and optionally hatoi for the remaining candidates accordingly. The output is a ranked set I  i1,...,iK Intuitively, the pool step ensures every image already overlaps well with the input terms high oi; the greedy step then spreads the shortlist across the vocabulary by spending per-term quotas, so each figurative word can only 'carry' the selection a limited number of times. The parameter lpha tunes this trade-off: lpha ightarrow 0 favours raw overlap strength including duplicates via delta. This projection is thus a two-stage proportioning: first by weighted overlap to secure relevance, then by quota-constrained gains to keep the list variegated across the input vocabulary, producing a compact legible image constellation around the words rather than a repetitive cluster. Because the searches are acknowledged to always be partial they bring a further insight into the figurative screen as to which sorts of figurative features are brought to the foreground through their presence alongside the aspects by which they were projected."}