{"created_at": 1763575150.0593762, "confirmed": true, "origin": "searched", "search_input": "The altitudes within a cell represent the \"spread\" of the conversations that particular cell can accomodate.", "suggested_query": "The idea is to use the altitude to give a sense of genericness or unusualness of a book within the SOM, as well as its location on the surface. This approach was first tested in an earlier experiment, which is included in the appendix. The results showed that the altitude mapping provided a useful way to visualize the relationships between books and their genericness within the SOM. With this in mind, the next step was to use the altitude mapping to select books for retrieval based on their location and altitude within the SOM. This was done by identifying the cells with the highest altitude values, which corresponded to the most generic or unusual books. These books were then selected for retrieval and display on the screen. The implementation of this process is described in the following section.  (more to follow)  (less)  (random)  (more)  (less)  (random)  (next)  (previous)  (first)  (last)  (next)  (previous)  (first)  (last)  (next)  (previous)  (first)  (last)  (next)  (previous)  (first)  (last)  (next)  (previous)  (first)", "suggest_context": "3.4 CONSTRUCTING THE 'SCREENS' This chapter is how to start establishing the screens, between which the different projections are cast. The screens are constructed through the technology of SOMs or the navigation through the whole of the data in the manner of a dataset query. We use the term screen because it is constrctued to facilitate the casting of a projection on a full domain of information, in principle to address a particular character of the way in which the projection is to be constructed. TEXT book Within the text domain, the first screen is that for the books. Here speed is important, because we're dealing with a large set of relatively high dimensional data 1.1M x 300. Apart from speed the other priority is that the concern isn't necessarily to just find the most similar books, but rather facilitate a view from the full collection of books and their subsequent contents on a particular point of view generally this point is defined by on or multiple books of its own. The implementation for this is chosen to be a spherical SOM built up by a geodesic dome degree 5, built up out of 20,480 vertices. Figure 3.4:1 -Two orthographic views of the spherical SOM trained on 1.1M books, coloured through PCA colourisation. Figure 3.4:2 - Flattened Hammer projection of the PCA coloured spherical SOM All books are then projected onto the SOM and assigned to a cell. This populated SOM is whosn in Figure 3.4:3. Figure 3.4:3 - Flattened Hammer projection with a heat-map of the projected number of books onto the SOM 1525 is the maximum number per cell, 0 the lowest Figure 3.4:4 - Activations of books in the dataset at indices 0, to 1,100,000 at 100,000 intervals The next step is the reason for using a spherical SOM in this particular instance instead of a toroid. The ambition was to make an ultra light measurement to establish which books should be retrieved, based on first global topic the location on the full som and second the internal cell 'altitude' of a book. This altitude was determined by fitting a PCA perpendicular to the 300 dimensional surface of the spherical SOM. The idea is that because the SOM is spherical the altitude also gives an impression of genericness internal to the SOM, negative altitude or unusual external to the SOM, high altitude. This approach is the result of an earlier experiment which is included in the appendix. Figure 3.4:5 - Example of an activation by book index 0 and the altitude of that book in each cell of the som. Figure 3.4:6 - Zoomed in altitude mapping on the activated region of the SOM The altitudes within a cell represent the \"spread\" of the conversations that particular cell can acc"}