{"created_at": 1762558970.718024, "confirmed": true, "origin": "searched", "search_input": "", "suggested_query": "The implementation of WIPTe involved a series of iterations, with the initial prototype being developed over a period of several months. Through this process, the editor's functionality was refined and the user interface was improved to better facilitate the writing process. The use of imagery and text allowed for a unique and engaging writing experience, with the ability to seamlessly switch between the two mediums. As the editor evolved, so too did its capabilities, with the inclusion of features such as film projections and standalone jupyter notebooks. The final version of the editor was a testament to the power of collaboration and the importance of user feedback in shaping the development process.", "suggest_context": "3. TEXT EDITOR Companions: The Writing Images and Picturing Text editor WIPTe forms the primary subject of this thesis, as well as its operation and context. The primary focus in constructing this multi-modal instrument together is to facilitate a constant setting within which this thesis is to be written. Therefore turning on itself both as an outline of what it is proposing as a research direction, all the time whilst demonstrating the outcome of its own question, simultaneaously. Therefore it was deemed of importance that WIPT was finished before the final writing stage. This chapter will go through all of the steps of its implementation, whilst continuing to be accompanied by the imagery and textual contexts it puts forward. The current version of the text editor facilitates a constant movement between text onto itself, as well as text onto imagery, with further granularity to show where these projections derive from through the reveal of films. The other two movements from imagery onto itself as well as imagery onto text are capable within the architecture of the editor, but have not been included in the active version, but are instead facilitated through standalone jupyter notebooks. After all, the primary activity the interactive editor is to facilitate is the writing of this thesis, however we will later visit how a picturing of a text can be explored through this instrument as well."}