{"created_at": 1763293772.667257, "confirmed": true, "origin": "searched", "search_input": "", "suggested_query": "As the void is essential for Atomism, it can be seen as a fundamental aspect of the Domains of Architecture, where the multi-modal gap serves as a void that allows for the atomism of the two distinct domains, treating them as separate entities always. The word as atom both in figurative as well as textual indices can be seen as a manifestation of this void. This concept of void is not only relevant for Atomism but also for the understanding of the relationship between the elements and primary matter. pdf It is also similar to the concept of the void in Platonic philosophy, where the void is seen as a fundamental aspect of reality. pdf In this sense, the void can be seen as a reference point, a fixed point that allows for the understanding of the multiplicity of references, and the scholarly reference of the doxographer can be seen as an endlessly assignable itinerary. pdf The void can also be seen as a source of mobility, allowing for the superposition of copies or translations, and freeing universal discourse from fixed points. pdf In this way, the void plays a crucial role in the understanding of the relationship between the elements and primary matter, and it is essential for the understanding of Atomism. pdf", "suggest_context": "The overall endeavour of the text editor is therefore one that sometimes strives to go towards the comical, certainly more than that of truth and absoluteness. - subject narrates the universal, the essential, the absolute; in tragedy, the subject enacts or stages the universal, the essential, the absolute; in comedy, the subject is or becomes the universal, the essential, the absolute. Which is also to say that the universal, the essential, the absolute become the subject. Zupancic, 2008, p. 39 pdf This gesture of taking the substance of 1.1M books and 12M images, and have them be put in proportion through 215 films in itself resonates with the statement of Hegel: In comedy, says Hegel, the Self is the absolute Being. In comic consciousness, all divine being returns, or it is the complete alienation of substance Hegel 1977, p. 455. That is to say: in comic consciousness, the substance is not alienated from the self or the subject as it is in the unhappy consciousness, it is alienated from itself, and this is the only way it comes to self-consciousness and to life in the strict meaning of the word. Comedy is not the story of the alienation of the subject, it is the story of the alienation of the substance, which has become the subject. Zupancic, 2008, p. 28 pdf However, it would be wrong to consider Empedocles an early forerunner of atomism, as Kranz does Kranz 1949, p. 83, because he lacks the concept of the void. pdf So the Void is essential for Atomism? What is the void in the context of Domains of Architecture? The idea of the multi-modal gap as void? Therefore allowing for the atomism of the two distinct domains? Therefore here explicitly treating them as separate entities always? The word as atom both in figurative as well as textual indices. As we have said, for Aristotle, the elements are only certain manifestations of primary matter. is implies that they can be transformed into one another. pdf This is much more akin to a physicist approach to matter, where Plato is more algebraic: Plat's concept of the four elements together in their proportions making up the whole is very close to group theory. This is more atom based maybe? Relevant for referencing multiplicity: Preliminary question: what is a reference? The multiplicity of references, in terms of erudition, doxography, encyclopedic dictionaries, and even linguistics and law, characterizes both Leibnizianism and their mathematical pluralism, precisely according to the same process. pdf Moreover, the scholarly reference of the doxographer implies, in a certain way, an endlessly assignable itinerary, through the superposition of copies or translations, from which universal discourse seeks to free itself, pdf just as any fixed point can be mobile with respect to another origin, and so ad libitum: this is indicated at the opening of De rerum where the infinite iteration of reasoning is concretized by the example of successive copies of Euclid's Elements."}