{"created_at": 1764016019.191733, "confirmed": true, "origin": "zotero", "search_input": "Following from this we can also contextualise the synergies between the different dimensions, based on how they present themselves through the vocabulary. For example, the five films that align themselves the most in conversation to *Chungking Express* by Wong Kar-wai are in order of likeness:", "suggested_query": "The textual screen's projections reveal a complex web of relationships between the films, with Chungking Express serving as a hub that connects to other films in various ways. For instance, the film's emphasis on nostalgia is mirrored in the vocabulary of the films that align with it, such as the use of words related to memory and longing. This synergy can be seen as a testament to the power of CLIP in uncovering the underlying structures of the textual domain, which in turn allows us to better understand the relationships between the films.  The process of activating the textual screen on each dimension also highlights the unique characteristics of each film, which can be seen as a form of 'fingerprint' that distinguishes it from others. This not only provides a more nuanced understanding of the films themselves but also opens up new possibilities for exploring the connections between them.", "suggest_context": "The textual counterpart lets us project a multitude of characteristics and indices onto the image, thus being able to address primary as well as secondary, tertiary etc. layers within the image. This is the reason that the figurative, even when on it's own terms, was encoded through this process. Exactly because it allows us to work with a layered content. - The only other potential way that would be able to engage with this is the use of SAM that lets us disect an image into subsequent parts, which is certainly interesting, but impractical because of heavy to compute, but also in the sense that it is also a very specific and singular manner of looking at the image through it's elements, instead of the whole, where CLIP can also capture multiple facets that are conveyed through the overall composition to a point of course. - So although it might read like we criticise CLIP in chapter 2, it is not a criticism on it as a tool, it is incredible in it's translational capacities. It's just that we'd like to think about the relation between text and image as a richer ground than just that of description, which is why we're eagerly working with CLIP in order to expose these other proportionalities. MULTIMODAL Both of the multi-modal screens sit within the dimensions corresponding to the multi-modal documents that make up the domain. As an example we will describe the multi-modal structure based on the 216 films described in 3.3. However any other collection of multi-modal documents as described in 3.3 would follow the same process in establishing the 2 operative screens. word Figure 3.4:8 - SOM of the 216 dimensional textual domain of films click to see large pdf. For the textual domain we will rely on the vectors wtF based on the subtitles of each film as described in 3.3. These vectors with the co-occurence nudge are the material for training a toroid SOM of 35x60 cells. A toroid SOM was chosen here because the legibility in a 2D format was deemed important in accordance with the ambition of a simultaneous reading of domains as explained in 2.4. The resulting screen is a populated grid of 2,100 cells with the 12,934 words from the mm216vocabt shown in figure 3.4:8. Activating the textual screen on each dimension, corresponding to a film each, gives us an insight to the different characteristics and emphasis that each film puts within the textual domain, shown in figure 3.4:9. Figure 3.4:9 - 216 projections of the textual screen, activated by dimensionfilm click to open full scale image. Following from this we can also contextualise the synergies between the different dimensions, based on how they present themselves through the vocabulary. For example, the five films that align themselves the most in conversation to Chungking Express by Wong Kar-wai are in order of likeness:"}