{"created_at": 1766100539.027029, "confirmed": true, "origin": "searched", "search_input": "The contribution of this research is to stage a limited and situated experiment with text–image modalities, as a preliminary probe into how architectural reasoning might be extended to computational multimodality. Its central aim is to test how multimodal ML models, when approached architectonically, might sustain proportion and heterogeneity between modalities, and avoid collapsing them into equivalence. In doing so, it frames a methodological stance that repositions computation as a speculative instrument for architectural reasoning.", "suggested_query": "As the instrument begins to take shape, the tension between numerical precision and qualitative insight becomes increasingly pronounced. The multimodal gap, initially a conceptual problem, starts to materialise as a technical challenge, as the computational experiments struggle to reconcile the specificity of the curated datasets with the vastness of the public corpora. It is here that the notion of projection as proportion must be rethought, moving beyond the binary opposition between alignment and difference, to encompass a more nuanced understanding of how the instrument can both stabilise and disrupt the relations between heterogeneous domains.", "suggest_context": "1.2.2 PROPOSAL Given the scope, and the intent of engaging with methodology over architectural material, the point being made is epistemic: architecture is mediated by many modes that do not collapse into a single model. Architectural thought does not, and never did, reside in one privileged representation, but in the proportional negotiations between several - drawings, images, texts, models - each standing apart, yet held together in practice. In the digital, this plurality meets a specific condition: vectorisation. To vectorise is to encode artefacts so that relations can be expressed as distances and neighbourhoods in a high-dimensional space. In this sense, contemporary computation introduces a geometry beyond the three-dimensional: not the geometry of solids, but of proximities, sometimes governed by explicit procedures, often emerging as probabilistic reductions. This condition is productive, but to the complexity of intuitive navigation within something we can't visualise - n-dimensions - it also comes with a risk: that translation becomes the default operation caption  image, prompt  output, and difference is flattened into alignment. The proposal of this thesis is to treat such projections as architectonic devices that stage relations between heterogeneous domains so they can be read, re-read, and re-proportioned. This is explicitly not a retreat from computation, but a call for its architectural recalibration. Le Corbusier, writing on the Modulor, warned against the seduction of numerical scales: Indeed it is a dangerous tool, for, starting out from its abstract obedience to numbers, one is tempted, by negligence or laziness, to perpetuate it in other convenient measures ... much to the detriment of architecture. Setting out with the ambition to find a harmonic alternative: a scale of visual measures has its place because the first effect of this new tool would be to unite, co-ordinate, bring into harmony the work which is at present divided and disjointed. These insights frame a historical precedent for the tension explored in this thesis: how instruments for measure can as easily narrow thought as they can open it. The aim here is to construct a multimodal architectonic instrument that can sustain the qualitative, the contingent, and the situated within the digital abundance of contemporary practice. Methodologically, this proposal is carried out through computational experiments that work in the multimodal gap using small, curated datasets from films, subtitles, photographs, and architectural papers. These curated selections function as casts: authored constraints that tune what may appear. They operate against larger, generic public corpora, books and images that function as screens of abundance, so that projection can become proportion rather than mere search or equivalence. Crucially, this staging is not external to the thesis: the project is developed and articulated through the Writing Images and Picturing Texts editor WIPTe, so that writing becomes the principal loop in which the instrument replies and the argument is tested in practice."}