{"created_at": 1765570815.350116, "confirmed": true, "origin": "searched", "search_input": "This split between geometric result and other considerations becomes especially visible in the preliminary interior perspective drawings that were developed during the design for the project, such as the one in Figure 1.1.2:1. In these Innenraum-Entwurf sheets Mies’s office draws the geometry itself as a minimal, precise construct in fine lines: columns, ceiling and the terrazzo floor are held in a clear grid that continues the paving of foyer and garden. Onto this restrained framework are inserted photographic reproductions of artworks and sculptures from the collection (Kandinsky’s Schwere Kreise, Lehmbruck’s figures, Maillol’s La Rivière) together with black-and-white photographs of a forest, filtered green and running as a dense band beyond the garden wall. As Caspary notes, these collages were meant *“den Charakter und Geist dieses Bereiches sowie seine Beziehung zum Garten klarmachen”*: to clarify the character and spirit of the lower exhibition hall and its relation to the garden. In other words, the drawing communicates in different modes at once: geometry is kept abstract and technical, while art and nature are given full tonal and material presence. This manner of drawing the space shows a deliberate decision about what should be carried by geometry and what must be articulated in other, non-geometric languages.", "suggested_query": "By juxtaposing these different modes, the drawing illustrates how Mies van der Rohes architectural project is not solely concerned with the creation of a geometric container, but with the cultivation of a specific atmosphere, one that is deeply rooted in the cultural and artistic context of the time. In this sense, the preliminary interior perspective drawings serve as a testament to the architect's emphasis on the complex interplay between form, function, and cultural significance.", "suggest_context": "Architectural computation therefore must create space for what does not count in the numerical sense, but which counts precisely because it resists reduction, because it is enacted through language-games, atmospheres, references and uses. Rather than enumerating non-geometrical aspects in an abstract sense, the following examples will foreground how, in specific projects, such operations beyond geometry become architecturally decisive, at least according to my personal reading of them. They will serve as demonstrations of how discipline, history, materials, politics and use operate at scales that do not fit neatly inside the 3D model, yet remain inseparable from what we recognise as architecture. Historical reference in simplicity A first, perhaps counter-intuitive, example is Mies van der Rohes Neue Nationalgalerie in Berlin. The building is regularly treated as a late, canonical statement of modernism: an almost abstract glass pavilion on a granite plinth, its upper hall conceived as a single, open universal space. In Miess own terms, however, this formal clarity is the outcome rather than the goal. In his aphorisms he writes that Architecture is the will of an epoch translated into space; living, changing, new Not yesterday, not tomorrow, only today can be given form and, crucially, Form is not the aim of our work, but only the result. Form, by itself, does not exist. Form as an aim is formalism; and that we reject. Even at the heart of modernism, then, form is cast as the outcome of other operations: an expression of an epoch, its tasks, its art. Figure 1.1.2:1 - Innenraum-Entwurf, 1962-1965, Neue Nationalgalerie. Credit: Staatliche Museen zu Berlin, Nationalgalerie  Fotograf unbekannt  Ludwig Mies van der Rohe, Innenraum-Entwurf, 1962-1965  VG Bild-Kunst, Bonn, 2025 This split between geometric result and other considerations becomes especially visible in the preliminary interior perspective drawings that were developed during the design for the project, such as the one in Figure 1.1.2:1. In these Innenraum-Entwurf sheets Miess office draws the geometry itself as a minimal, precise construct in fine lines: columns, ceiling and the terrazzo floor are held in a clear grid that continues the paving of foyer and garden. Onto this restrained framework are inserted photographic reproductions of artworks and sculptures from the collection Kandinskys Schwere Kreise, Lehmbrucks figures, Maillols La Rivire together with black-and-white photographs of a forest, filtered green and running as a dense band beyond the garden wall. As Caspary notes, these collages were meant den Charakter und Geist dieses Bereiches sowie seine Beziehung zum Garten klarmachen: to clarify the character and spirit of the lower exhibition hall and its relation to the garden. In other words, the drawing communicates in different modes at once: geometry is kept abstract and technical, while art and nature are given full tonal and material presence. This manner of drawing the space shows a deliberate decision about what should be carried by geometry and what must be articulated in other, non-geometric languages."}