{"created_at": 1765583915.1648908, "confirmed": true, "origin": "searched", "search_input": "At this point, the distance to the contemporary digital condition described by Hovestadt becomes clear. In the introduction to Atlas of Digital Architecture he insists that information technology “touches, it infuses, inhabits, everything,” and that “absolutely everything we do and have today is in one way or another possessed of digitality.” \"Today\", he writes, *\"we have an abundance of images, indexes, references,\"* and “digitality is reaching omnipresence,” such that the real challenge is not growing complexity but an overwhelming simplicity in which “it’s not us who understand computers any longer, it’s computers that understand us,” leading to saturation rather than scarcity. In such a saturated, generic field, architectures, models and images circulate as part of a shared, indexed background. The projects we recognise as masterpieces do not prefigure this condition, but they show why a purely geometric encoding is insufficient: each already depends on disciplinary memory, narrative, atmosphere and use in excess of its measurable form. These extra-geometric operations are precisely what allow such works to persist, to be re-read and re-indexed within today’s digital abundance. In this sense, digital architectural encodings dealing with the non-geometrical cannot rely only on a structuralist idea of form as total code; they must also register the fluid, indexical and sometimes misaligned operations through which architecture participates in this digitally saturated field. The emphasis thus shifts from what is modelled to how we think with models: what kinds of games, stories, projections and mis-readings our digital instruments permit.", "suggested_query": "The implications of this tension are far-reaching, as they question the very possibility of a formal code that could articulate architecture's essence. If form is no longer a stable, generic structure but a dynamic, probabilistic process, then architecture's attempt to encode itself as a total system of relations becomes increasingly precarious. The promise of a single, all-encompassing form that mediates between intent, function, structure, and technics starts to unravel, leaving in its wake a fragmented, probabilistic landscape where architecture's essence is dispersed across multiple, interconnected modalities.", "suggest_context": "In this model, the architectural object is a legible resolution of a deeper, more abstract order. Read against the context of the 1960s, Eisenmans position resonates with structural linguistics and early generative grammar: a finite deep structure generates infinitely many well-formed sentences. Generic form plays the role of such a deep structure; specific buildings are its instantiations. The promise is that architecture can be articulated as a total system of relations, with form as the all-encompassing code that mediates between intent, function, structure and technics. From this perspective it is tempting to imagine that a fully detailed 3D model, together with its parametric rules, layers and schedules, could serve as a sufficient encoding of an architectures essence. Jorge Orozco Esquivel underlines this ambition when he notes that Eisenman seeks an architectural logic based on form, where the giving of form is far more than the making of shapes and becomes a way of presenting order at both building and environmental scales. In Orozco's reading, Eisenmans synthesis of intentfunction and structuretechnics addresses both the ideal and the real, the generic and the specific, the semantic definitions and symbolisations through which architecture communicates. Form is not mere appearance; it is the medium through which architecture as a whole is encoded and made communicable. At the same time, this project arises from a very specific anxiety. Eisenman writes in a moment when our social, economic, and technological environment has become so overwhelmingly distended that no significant order can be perceived by the individual, and therefore we must establish a basic priority in architecture. For him that priority is formal clarity, anchored in some well-understood archetypal solid and in a conceptual whole the observer can grasp. Jorge explicitly contrasts this with our own situation, remarking that today our paradigm revolves about the probable and the unknown. In other words, Eisenmans structural formalism is already a response to an overload of information, but it responds by tightening form into a stable code. Seen from the contemporary digital condition and in particular with regards to machine-learning, this move is double-edged. On the one hand, it subverts older notions of form as detached from function or atmosphere: for Eisenman, form is precisely the place where intent, function, structure and technics are synthesised, not something added afterwards. On the other hand, it still assumes that such synthesis can be stabilised as a generic structure. Large language models, for instance, complicate that assumption: their generativity does not rely on an explicit deep grammar in the Chomskyan sense, but on high-dimensional statistics of use. They operate closer to Wittgensteins meaning is use than to an a priori structural code. This suggests that an all-encompassing formal encoding, whether in a theory or in a BIM model, will struggle to keep pace with architectures that materially participate in such probabilistic, multimodal environments."}