{"created_at": 1765638413.138892, "confirmed": true, "origin": "searched", "search_input": "This introduces a new kind of non-calculable. Where formal languages promise symbolic transparency at the cost of combinatorial tractability, and soft machines promise adaptability at the cost of explicit structure, contemporary models offer powerful pattern-recognition at the cost of interpretability. Their “knowledge” takes the form of distributed statistical structure, accessible only indirectly through prompts, projections and probes.", "suggested_query": "", "suggest_context": "Turing.113Marincic3 In his reading, The Architecture Machine anticipates a future of collaboration between human designers and fully conscious intelligent machines, while Soft Architecture Machines extends this into a cybernetic vision of responsive environments that negotiate directly with users. Technically, these systems often reduce to rule-based spatial allocation or heuristic search, and their implementations remain relatively simple compared to their philosophical ambitions. Yet for the purposes of this thesis, their importance lies elsewhere: they mark an early architectural attempt to encode not just form, but design intelligence itself; preferences, negotiations, and feedback, as computational material. They extend the historical horizon of architectural computation beyond geometric modelling to participatory, communicative processes, even if their AI paradigm and autonomy-driven ambitions differ markedly from the probabilistic, multimodal models discussed in the remainder of this work. From explicit formalisms to statistical language If formal languages and soft machines represent attempts to articulate computation as explicit structure, either through grammars of well-formed expressions or through conversational rules, contemporary machine learning complicates both. On one side, it realises Lovelaces prediction that engines could act on other things besides number: large language models, recommender systems and vision models operate on speech, text, image and behaviour without relying on hand-crafted symbolic codes. On the other side, they no longer primarily depend on explicit grammars or pattern libraries. Instead, they learn high-dimensional statistical representations from large corpora of examples. In distributional semantics and large language models, words and tokens are embedded as vectors based on patterns of co-occurrence. Meaning is not stored as a fixed entry in a lexicon, but emerges from position in a field of differences. This non-formalist stance extends to multimodal models like CLIP, where images and captions are mapped into a shared vector space and associated by proximity. Such systems work not by following specified rules about what an architectural faade or a public square is, but by internalising a vast, probabilistic sense of how such phrases and images tend to appear together. Mario Carpo has argued that digitally made objects are increasingly identified not by visual resemblance, but by the recognition of hidden patterns, on computational algorithms, or on other nonvisual features. In his example of credit cards, visual inspection gives way to algorithmic verification; authenticity becomes a function of a numerical sequence rather than an image. This shift from surface resemblance to encoded pattern is precisely what contemporary multimodal models operationalise. They do not simply store a geometric model or a textual description; they internalise correlations across billions of tokens and pixels. Architectural drawings, texts and photographs become points in such a space, linked by similarities that often exceed what a designer consciously specifies. This introduces a new kind of non-calculable. Where formal languages promise symbolic transparency at the cost of combinatorial tractability, and soft machines promise adaptability at the cost of explicit structure, contemporary models offer powerful pattern-recognition at the cost of interpretability. Their knowledge takes the form of distributed statistical structure, accessible only indirectly through prompts, projections and probes."}