{"created_at": 1767046562.784396, "confirmed": true, "origin": "searched", "search_input": "", "suggested_query": "As the cloud's indeterminacy is acknowledged, the architect's task shifts from crafting deterministic systems to embracing the ambiguity of space and the ways in which it is perceived and interacted with. This requires a willingness to question and challenge the familiar, to disrupt the habitual and the institutional, and to create a space that is not predetermined but open to the possibilities of the future. The cloud, in this sense, becomes a metaphor not only for the indeterminacy of physical systems but also for the dynamic and ever-changing nature of human experience and interaction. As such, the architect's role is not to impose order but to facilitate the emergence of new forms and new ways of being in the world.", "suggest_context": "In Of Clocks and Clouds, Karl Popper proposes that physical systems range from the highly regular clocks to the irregular clouds, with the conclusion that any physical system is, in the end, a cloud that may at times behave like a clock. The endeavour of computational architecture to systemise design into deterministic algorithms clocks is futile, as it does not allow for it to remain a cloud. The clockness of a cloud remains something that is perceived from the cloud, but not distilled into it. In accordance this is how Ishigami speaks about the tuning of space through perception and moving through scales, highlighting the value of ambiguity in discerning proportionalities. It is the nature of interactions in space that determine it. As Koolhaas speaks about the occurrences in Rhode Island If Paris is France, Coney Island, between June and September, is the World. , the turns that new ways of interacting in space bring, influence how we as a whole experience and in turn interact with everything - the world. These considerations seem to be necessary to make the emerging abstraction accessible, and something that can be entered instead of it becoming a closed system. This way the architect is concerned with understanding a complex body and embracing its indefinite character to put the related space in proportion, as opposed to crafting systems creating complexity of deterministic nature. Similarly to the intellectual according to Foucault the role of architects would be the analysis of their familiar domain and how this can be re-questioned to shake up habits and change the ways of acting and thinking, against the rules that are imposed through familiarity and institutions."}