{"created_at": 1765571797.495701, "confirmed": true, "origin": "searched", "search_input": "", "suggested_query": "The Metabolists' emphasis on adaptability, flexibility, and continuous public talk resonates with the fluid, dynamic, and context-dependent nature of digital architectural instruments. By acknowledging the interplay of geometry, language, and the multiple registers of the public face of architecture, these instruments can facilitate a more nuanced understanding of architectural agency, one that incorporates the complex, situated, and performative dimensions of the built environment.", "suggest_context": "Its actions intersect with a huge range of unrelated domains; at the same time, its essence to build is so complex that it requires extreme focus and concentration. Sadly therefore, it is largely inhabited by two human typologies, \"builders\" and \"thinkers,\" united in mutual disdain. Kenzo Tange was both.\" Koolhaas and Obrist underline that the Metabolists were a group of architects who saw their country and its transformation as a project, working together in a strategic alliance that mobilised a vast range of other disciplines, amplified by bureaucracy, business and media. Some protagonists would in fact become more influential in these arenas than through their built oeuvre, finding leverage in planning committees, expo organisations, advisory boards, broadcasting and even electoral politics. Their architectural thinking reappears there as spatial policy, national branding, and the programming of new publics rather than as singular objects. Kisho Kikutake describes the book Metabolism 1960 not as a single dogmatic statement but as a compilation of things wed each done, more give and take about methodology than a declaration of principle, held together by critic Noboru Kawazoe, who asked what unique qualities and ideas Japan could bring to the world. In this view, the movement is less a closed manifesto than a platform for coordinated but heterogeneous experiments. Obrist characterises Metabolism as an avant-garde whose members held out for the idea of the flexible manifesto, up for continual renegotiation,\" operating in a constant flow of proposals, buildings, and a ceaseless production of texts., fitting for a movement that underlines adaptability to changes. In this sense, the architectural work of Metabolism resides as much in conferences, manifestos, drawings, masterplans, television performances, bureaucratic manoeuvres and policy experiments as in its famous capsules and megastructures. What matters for this thesis is less nostalgia for a lost avant-garde than the kind of architectural agency this configuration models: an architecture that acts through public policy, media, large-scale speculation and a continuous public talk as much as through individual buildings. These registers of the public face of architecture clearly exceed the mere presence of a built object in the public domain. Whatever we call a digital architectural instrument should therefore be able to register and work with such conversations and projections, not only with their geometrical traces. Language Games In all these cases, geometry is necessary but not sufficient. The CAD model can specify the grid of columns in Berlin, the slope of the Kunsthal ramps, the modularity of metabolist pods. But their architectural status depends on operations that exceed geometric representation: disciplinary memory, material and cultural referencing, choreographies of movement, political ideology, economic registers, integration of art and building, the slow inscription of use and discourse. A BIM model can host tags and metadata about these things; it cannot encode their interplay. The soft and operative dimensions of architecture, its narratives, atmospheres, and mis-readings, behave more like open-ended language-games than like closed geometric objects."}