{"created_at": 1766095947.023432, "confirmed": true, "origin": "searched", "search_input": "Bühlmann’s reconstruction of Serres helps to fix the propositional stance. For Serres, models are not primarily representative or explanatory, but instrumental and operative: they “realise” a phenomenon and are themselves active, endowed with a kind of mentality or character. Models are not mirrors but devices: they create conditions under which relations can appear, be measured, and be transformed. Measurement still matters, but it may run along axes of probabilities, proximities, and indices, rather than along classical notions of correctness or exactitude. The ambition pursued here is to treat digital models in precisely this way: as architectonic instruments that facilitate reading, and re-reading, relations between heterogeneous communications.", "suggested_query": "This instrumental understanding of models is not only a departure from the dominant representational paradigm, but also from the widespread assumption that digital models are merely visualisations or simulations of already existing architectural projects. Instead, digital models are treated here as a medium that can generate new architectural possibilities and relations, rather than simply reflecting or representing existing ones. This is not to say that digital models lack a connection to existing projects, but that their primary function is not to illustrate or document, but to create and facilitate the emergence of new architectural meanings. In this sense, digital models are not just a tool for architects, but a partner in the creative process, capable of influencing and shaping the design itself.", "suggest_context": "1.2 AMBITION But the arts of which we speak should, on the contrary, by means of numbers and relations of numbers, engender in us not a fable, but that hidden power which makes all fables. - Paul Valry, Dialogues The previous chapter 1.1 has outlined the challenge of facilitating architectural thought within the digital beyond geometrical encoding. The current geometry-forward digital 3D model is powerful, yet prone to monopolising architectural process by over-identifying architecture with its most readily computable register. The ambition here is to work from the opposite direction: to attend to the operations that make architectural communication relate across domains. What matters is not just what computation can represent and produce, but what information technologies can stage: how it can host the registers through which architecture persists as culture, atmosphere, discourse, and discipline. This thesis therefore explores how a manner of architectural thinking can be applied within the digital by cultivating an instrumented space of constant interaction, a sort of informational playground, where architectural processes remain active, and where modalities do not collapse into a single, sovereign axis. The aim is therefore not an other translation of architecture into data, but an architectural engagement with dominant digital modalities most insistently: text and image, treating their difference as a productive constraint rather than a gap to be aligned away. Bhlmanns reconstruction of Serres helps to fix the propositional stance. For Serres, models are not primarily representative or explanatory, but instrumental and operative: they realise a phenomenon and are themselves active, endowed with a kind of mentality or character. Models are not mirrors but devices: they create conditions under which relations can appear, be measured, and be transformed. Measurement still matters, but it may run along axes of probabilities, proximities, and indices, rather than along classical notions of correctness or exactitude. The ambition pursued here is to treat digital models in precisely this way: as architectonic instruments that facilitate reading, and re-reading, relations between heterogeneous communications."}