{"created_at": 1763169979.775531, "confirmed": true, "origin": "zotero", "search_input": "Methodologically, this corpus demonstrates that the instrument is not limited to inherently multimodal sources (like film or illustrated PDFs). Cross-casting can be staged by selecting a textual vocabulary on one side and a curated image set on the other, then proportioning them through the same generic screens. This manufactured adjacency underscores the central claim: projection precedes equivalence and can be made personal without becoming arbitrary.", "suggested_query": "The latter half of the chapter will elaborate on the technical means by which this is achieved, but for now, it suffices to note that the resulting projections are not mere aggregations of text and image, but rather novel entities that exhibit emergent properties at the interface between the two.  In this regard, the instrument is less a tool for information retrieval than a medium for generating new knowledge through the strategic alignment of disparate cultural artifacts.  The remainder of this chapter will explore the implications of this approach for our understanding of the relationship between language and image in contemporary culture.  It will also introduce the reader to the specific technical infrastructure that enables these projections, and describe the various corpora and datasets that have been used to test the instrument's capabilities.", "suggest_context": "Crucially, no attempt is made to collapse one channel into the other; adjacency is staged, not asserted as equivalence. Later chapters will mobilise this material to derive figurative concepts that orient image search and composition across the generic domains, while keeping the multi-modal gap intact. INSERT LIST OF FILMS 2. PDF A second corpus turns to PDFs with substantial figurative content. In contrast to film, these documents are denser in text and comparatively sparse in images, and they often organise images diagrammatically or editorially rather than cinematographically. This difference is intentional: it tests the instrument under a textual regime in which images are fewer but often more pointed. Here there is less of a personal view in the selection of the specific documents than with the films, but rather these data collections aspire to demonstrate the ability to foster projections tuned to a specific discourse. Two collections are used. 1 AA Files  1,247 articles from the Architectural Associations AA Files 19812012. The journals writing sits between research discourse and design language, with images ranging from photographs to drawings and diagrams. The mix of image types yields a distinct figurative register that contrasts with film stills and PD12M imagery. 2 ETH Zurich PhDs  a set of 500 dissertations, of which 200 are used here because they exceed a 50-image threshold. The intent is to model the content of these theses, but to exploit their image density and disciplinary heterogeneity to probe how the instrument behaves when images are embedded in long-form argument. And of course in this thesis it serves as a play in which we can explore how peers have proportioned image to text in the past. As with film, co-presence is preserved without forcing alignment: page-level or figure-level positions allow projection, but captions, figure numbers, and paratexts are not operationalised as descriptive truth. The documents are treated as image-rich textual fields whose figurative moments can be cast into the generic IMAGE domain and back toward TEXT . 3. PHOTOGRAPH WITH STORY The final corpus constructs multimodality deliberately by placing two distinct datasets into relation: a vocabulary of Roald Dahls stories and the scenographic imagery of Tim Walker. Here, the two channels are not inherently coupled; instead, one domain serves as a cast through which the other is projected. The wager is that single images, treated as documents in their own right, carry sufficient figurative depth to sustain projections across domains when held in tension with a narrative lexicon. Methodologically, this corpus demonstrates that the instrument is not limited to inherently multimodal sources like film or illustrated PDFs. Cross-casting can be staged by selecting a textual vocabulary on one side and a curated image set on the other, then proportioning them through the same generic screens. This manufactured adjacency underscores the central claim: projection precedes equivalence and can be made personal without becoming arbitrary."}