{"created_at": 1766111780.2941859, "confirmed": true, "origin": "searched", "search_input": "Where chapter 1 situated the thesis within architecture, this chapter will serve to formulate a perspective onto the primary condition that the thesis revolves around: multimodality. Before introducing the experimental setup, this chapter first reviews the current occurrences of multimodal relations between domains of information within computation and architecture. This will serve as the technical-theoretical basis upon which the experiments will reflect. As previously stated, the aim is not to prescribe applications for architectural representation, but to draw from how architects already work across modalities in order to frame digital multimodal models from an architectonic perspective.", "suggested_query": "3. The concept of multimodality has been a topic of interest in various fields, including linguistics, anthropology, and computer science. In the context of architecture, multimodality can be seen as the ability to navigate and manipulate different modalities of information, such as visual, spatial, and textual representations. This chapter will explore how architects already employ multimodality in their work, particularly in the design process, and how this can be leveraged to develop more sophisticated digital models of architectural representation.", "suggest_context": "2. MULTIMODALITY Where chapter 1 situated the thesis within architecture, this chapter will serve to formulate a perspective onto the primary condition that the thesis revolves around: multimodality. Before introducing the experimental setup, this chapter first reviews the current occurrences of multimodal relations between domains of information within computation and architecture. This will serve as the technical-theoretical basis upon which the experiments will reflect. As previously stated, the aim is not to prescribe applications for architectural representation, but to draw from how architects already work across modalities in order to frame digital multimodal models from an architectonic perspective."}