{"created_at": 1762600551.720883, "confirmed": true, "origin": "searched", "search_input": "- The purpose of the text editor is manyfold. It is to make the writing of the thesis its own experiment, because if proposing a different way of writing then what better way to demonstrate that in the writing itself? Furthermore it is to form a manner in which the transitions between image and text constant, and volatile while the method stabilises through the demonstration of its use throughout an extensive document. The other aspect is to take the coded out of the coding environment as this is the only way to domesticate its use, for as long as we're engaging with the information in a coded way we are inevitably bound to be engaging with it through the thought of it's higher level structure. Of course this is essential, and therefore this process will be outlined in detail throughout this chapter, however in order to domesticate the information within a non coding activity it has to become intuitive and constant, in the same way that the 3D models on the shelves are present in the studio of OMA the images and texts have to be present constantly, effortlessly, and quickly in order to interwine themselves with the process of writing as is. To refer back to the new materiality discussed earlier, the ambition here is to start getting a sense for these pieces of information, and to combine and sculpt them into the synthetic process of writing by incorporating their characteristics within these new contexts. This is also in line with the ambition to move beyond the attitude of set based approaches, but instead trying to emulate an algebraic manner of forming equations, therefore maintaining the presence of both domains at all times.", "suggested_query": "The constructed correlation between modalities is facilitated by a chosen set of multi-modal documents, including images and texts that are seamlessly integrated throughout the document. This correlation is not predetermined but rather emerges through the process of writing, as the text editor constantly negotiates the boundaries between the private and public spheres. Furthermore, the role of the model is not limited to the curation of a selection of 215 films, but also includes the construction of correlations between different modalities, such as image and text, and the formation of a synthetic process of writing that integrates the characteristics of these modalities. The primary dataset for this is the selection of 215 films, which serves as a foundation for the development of other modes that can be used to establish different biases and correlations. The purpose of this model is to demonstrate the potential of a multi-modal approach to writing, and to showcase the possibilities of integrating different modalities in a seamless and intuitive manner.", "suggest_context": "3.1 OUTLINE - The text editor operates in a multi-modal manner, constantly both personal and general. - There are different layers of private and public: the private construct of choices and curation facilitates the projection on the common sense - The Scales of the data differs. Therefore the role of the model is here interpreted as the curation and construction of the correlation between the modalities that are facilitated by a chosen set of multi-modal documents. The primary dataset for this is a selection of 215 films which are used as the primary model used to write this thesis. This chapter will describe how this model is constructed and how other modes can be used to establish other biases, which will be demonstrated in the writing of chapter 4. - The purpose of the text editor is manyfold. It is to make the writing of the thesis its own experiment, because if proposing a different way of writing then what better way to demonstrate that in the writing itself? Furthermore it is to form a manner in which the transitions between image and text constant, and volatile while the method stabilises through the demonstration of its use throughout an extensive document. The other aspect is to take the coded out of the coding environment as this is the only way to domesticate its use, for as long as we're engaging with the information in a coded way we are inevitably bound to be engaging with it through the thought of it's higher level structure. Of course this is essential, and therefore this process will be outlined in detail throughout this chapter, however in order to domesticate the information within a non coding activity it has to become intuitive and constant, in the same way that the 3D models on the shelves are present in the studio of OMA the images and texts have to be present constantly, effortlessly, and quickly in order to interwine themselves with the process of writing as is. To refer back to the new materiality discussed earlier, the ambition here is to start getting a sense for these pieces of information, and to combine and sculpt them into the synthetic process of writing by incorporating their characteristics within these new contexts. This is also in line with the ambition to move beyond the attitude of set based approaches, but instead trying to emulate an algebraic manner of forming equations, therefore maintaining the presence of both domains at all times."}