{"created_at": 1765571964.414679, "confirmed": true, "origin": "searched", "search_input": "At the same time, this project arises from a very specific anxiety. Eisenman writes in a moment when *“our social, economic, and technological environment has become so overwhelmingly distended that no significant order can be perceived by the individual,”* and therefore *“we must establish a basic priority in architecture.”* For him that priority is formal clarity, anchored in “some well-understood archetypal solid” and in a conceptual whole the observer can grasp. Jorge explicitly contrasts this with our own situation, remarking that today *“our paradigm revolves about the probable and the unknown.”* In other words, Eisenman’s structural formalism is already a response to an overload of information, but it responds by tightening form into a stable code.", "suggested_query": "By focusing on form, Eisenman's theory shares with the Metabolists an emphasis on the importance of architecture as a discipline that transcends mere functionality. While the Metabolists sought to merge architecture with urban planning and engineering, Eisenman's notion of form as primacy suggests a more autonomous, yet still relational, concept of architectural agency. This agency is not solely tied to the built object, but also to the process of giving form to intent, function, and technics. In this sense, the architectural object is not just a product, but a site of negotiation between various forces and registers. The architectural work of Metabolism, as we saw, resides not only in its iconic buildings, but also in its conferences, manifestos, drawings, and policy experiments. Eisenman's theory, in turn, highlights the importance of a shared language for architecture, one that can facilitate a dialogue between different stakeholders and disciplines. In this context, the role of the architect is not only to design buildings, but also to mediate and navigate the complex interplay of forces that shape the built environment.", "suggest_context": "Kisho Kikutake describes the book Metabolism 1960 not as a single dogmatic statement but as a compilation of things wed each done, more give and take about methodology than a declaration of principle, held together by critic Noboru Kawazoe, who asked what unique qualities and ideas Japan could bring to the world. In this view, the movement is less a closed manifesto than a platform for coordinated but heterogeneous experiments. Obrist characterises Metabolism as an avant-garde whose members held out for the idea of the flexible manifesto, up for continual renegotiation,\" operating in a constant flow of proposals, buildings, and a ceaseless production of texts., fitting for a movement that underlines adaptability to changes. In this sense, the architectural work of Metabolism resides as much in conferences, manifestos, drawings, masterplans, television performances, bureaucratic manoeuvres and policy experiments as in its famous capsules and megastructures. What matters for this thesis is less nostalgia for a lost avant-garde than the kind of architectural agency this configuration models: an architecture that acts through public policy, media, large-scale speculation and a continuous public talk as much as through individual buildings. These registers of the public face of architecture clearly exceed the mere presence of a built object in the public domain. Whatever we call a digital architectural instrument should therefore be able to register and work with such conversations and projections, not only with their geometrical traces. Language Games In all these cases, geometry is necessary but not sufficient. The CAD model can specify the grid of columns in Berlin, the slope of the Kunsthal ramps, the modularity of metabolist pods. But their architectural status depends on operations that exceed geometric representation: disciplinary memory, material and cultural referencing, choreographies of movement, political ideology, economic registers, integration of art and building, the slow inscription of use and discourse. A BIM model can host tags and metadata about these things; it cannot encode their interplay. The soft and operative dimensions of architecture, its narratives, atmospheres, and mis-readings, behave more like open-ended language-games than like closed geometric objects. At the same time, we cannot ignore that form plays a central role in architecture as a whole, including in the manifestation of the aspects beyond geometry discussed above. For an architects account of architectures inherent relation to form, we turn to Eisenman. In his early essay Towards an Understanding of Form in Architecture, he argues that formal considerations are basic to all architecture regardless of style and that they alone can help develop an agreed language both for criticism and for design. Architecture, for him, is in essence the giving of form  to intent, function, structure, and technics, with form occupying a position of primacy in the hierarchy of elements. He distinguishes a generic form, close to a Platonic or structural template, from specific form, the concrete configuration that realises a particular intent and function. In this model, the architectural object is a legible resolution of a deeper, more abstract order."}