{"created_at": 1766769485.18132, "confirmed": true, "origin": "searched", "search_input": "He argued that structure is there within the wall, but the importance of the wall is the visible spatial enclosure. As thin as possible: fantasy of the two-dimensional wall, sketched in 3D by SANAA for the Kunstlinie Almere, Netherlands. The meaning of the wall is just as diverse as the uses of vertical surface can be, but there are at least two essential functions: providing structure and dividing space. The two can be separated, and thus the category of 'wall' divides into two: the bearing wall, separating roof from ground; and the partition wall, organizing movement within the resulting container. The former, it would seem, is as stable as the human need for shelter; the latter as changeable as our forms of sociability.", "suggested_query": "The latter's adaptability stems from the ability of partition walls to be easily dismantled or rearranged, reflecting the dynamic nature of human relationships. In this regard, the partition wall can be seen as a mediator between structure and social organization, facilitating the coexistence of diverse activities and occupants within the dwelling. The bearing wall, on the other hand, remains a constant presence, providing the foundation for the very existence of the dwelling.", "suggest_context": "4.1.2 WALL How the lapse of time affects ownership and usage of the wall. Hanging loosely, perhaps flapping, the woven screen generates- and, crucially, symbolizes - the division and organization of activities within the primitive dwelling. The woven \"wall\" is an enabler of civilization; the thick structural wall merely a defender of it.The hanging wall has an apparent descent compared to the foot wall. He argued that structure is there within the wall, but the importance of the wall is the visible spatial enclosure. As thin as possible: fantasy of the two-dimensional wall, sketched in 3D by SANAA for the Kunstlinie Almere, Netherlands. The meaning of the wall is just as diverse as the uses of vertical surface can be, but there are at least two essential functions: providing structure and dividing space. The two can be separated, and thus the category of 'wall' divides into two: the bearing wall, separating roof from ground; and the partition wall, organizing movement within the resulting container. The former, it would seem, is as stable as the human need for shelter; the latter as changeable as our forms of sociability."}