{"created_at": 1766454821.937453, "confirmed": true, "origin": "searched", "search_input": "The figurative domain is addressed primarily through word labels. These are indices, anchors by which images can be grasped, not to be read as exhaustive descriptions of image content. Because the used vocabulary is dictated by the multimodal cast, the anchors are specific to that sensibility, and the figurative words can therefore be interpreted as a set of distinct symbolic tags rather than interpreting the words in their general textual meaning. The semantic identity of a label in the figurative domain is not assumed to match its textual counterpart; the two are related only architectonically, through the multimodal model as cast. As such the figurative word only has one embedding, the one defined through word . So $w_f = w_{fF}$, which will be described below.", "suggested_query": "The word labels, therefore, are not merely descriptive, but rather function as anchors that facilitate the multimodal cast's understanding of the images. This is particularly evident in the case of images that depict abstract concepts or emotions, where the word labels serve as a means of bridging the gap between the visual and linguistic modalities. For instance, an image of a sunset might be labeled with words such as \"serenity,\" \"peace,\" or \"calm,\" which allow the multimodal cast to grasp the emotional resonance of the image. In this way, the word labels become an integral part of the figurative domain, enabling the cast to navigate and make sense of the images in a way that is both meaningful and context-dependent.", "suggest_context": "So where the primary role of words in the other text domains is to form the dimensionality for the documents, here the documents form the dimensions for the words. The vectorisation method of these words will be discussed in the subtitle section later this chapter. writing and suggestion The other elements within the text domains are writing , encoded as x the current editor text being written, and the suggestion extrapolated from writing by an LLM Llama-3-8B-Instruct.Q5KM is encoded as sigmax. We process both like the paragraphs to live in the same space as p. Neither x nor sigmax aggregate to a corpus; they are navigational probes used to communicate with other elements. FIGURATIVE The figurative domain, deals with the images on their own, without additional information outside of the image document. To distinguish this from the frames in the film we strictly distinguish between image and frame, although the methods used largely overlap. image Each image is primarily encoded with CLIP or in the case with the PD12M dataset, a CLIP encoding is already present. This encoding iv is maintained and stored, however does not serve as the primary means through which the image screen is operationalised. Instead we label images with words from the vocabulary with which they are to communicate in the case of the 216 films this would be the mm216vocab , see below. This is done through the vectorisation of the vocabulary in the same CLIP model Vit-L14 in the case of PD12M with four leading prompts: As such we do not engage with the image domain directly through its generic encoding iv, but we always approach it specific to the multimodal cast to which it is to perform as a generic screen. Based on the labels each image is assigned the top 20 words from each prompt as a set of labels, forming iw. This is the symbolic representation of the images that will be relied on to operationalise the domain through an SQL database. Further explained in chapter 3.6. Figure 3.3:1 - Image 613 from the PD12M dataset with 120 assigned labels from the mm216vocab based on 4 prompts. word The figurative domain is addressed primarily through word labels. These are indices, anchors by which images can be grasped, not to be read as exhaustive descriptions of image content. Because the used vocabulary is dictated by the multimodal cast, the anchors are specific to that sensibility, and the figurative words can therefore be interpreted as a set of distinct symbolic tags rather than interpreting the words in their general textual meaning. The semantic identity of a label in the figurative domain is not assumed to match its textual counterpart; the two are related only architectonically, through the multimodal model as cast. As such the figurative word only has one embedding, the one defined through word . So wf  wfF, which will be described below."}