{"created_at": 1765632203.409667, "confirmed": true, "origin": "searched", "search_input": "For the purposes of this thesis, the value of these formal and pattern-based approaches lies in the way they extend what counts as computable architectural content. Alexander’s patterns encode social and spatial situations in textual form; shape grammars encode stylistic families as rule-based geometric transformations; the domain-specific language encodes spatial relations as logical predicates.", "suggested_query": "As this language is pushed to its limits, it becomes clear that a more nuanced understanding of architectural computation is needed, one that acknowledges the inherent complexity and ambiguity of the design process. The DSL, with its rigorous adherence to formal logic, struggles to capture the messiness of architectural practice, where design decisions are often made through a dance of intuition, experience, and social negotiation. It is here that the work of Alexander and the pattern languages can be seen as a counterpoint to the formalism of the DSL, offering a more human-centered approach to the design process. The patterns, after all, are not simply a collection of rules or transformations, but a way of thinking about the relationships between people, spaces, and buildings. They are a way of encoding the social and cultural contexts in which architecture is designed and used. In this sense, the patterns can be seen as a form of \"social grammar\" that complements the formal grammars of shape and space. By combining these two approaches, it is possible to create a more comprehensive understanding of architectural computation, one that acknowledges the complexities of both the formal and the social aspects of design.", "suggest_context": "Although Alexander does not define his system in the formal notation of computer science, the underlying gesture is comparable: to identify a finite, reusable repertoire of constructs that can be combined into indefinitely many designs. It is not coincidental that this work later inspired software design patterns in object-oriented programming, where recurring problems in code structure are likewise documented as reusable patterns, making Alexander a rare example of a modern architect to be a core reference in a canonical book for computer science. From a more explicitly formal standpoint, Stiny and Gips shape grammars translate this grammatical paradigm into operations on shapes. Here, lines, polygons or solids play the role of words, and rules rewrite one configuration into another. Mitchell and Stinys later work takes Chomskys definition of a language as the set of all possible valid sentences to argue that what they define as a style can be described as the set of forms generated by a particular shape grammar, and thus language. As Marini underlines, such recursivegrammatical models promise efficiency, complex families of forms from a small rule set, but they tend to concentrate on the mechanics of geometric transformation, unfortunately ignoring the mathematical basis of Chomsky's procedure and leaving broader architectural notions under-specified. For a more exhaustive technical placement of pattern languages, shape grammars and related approaches within the history of architectural computation, I refer to Marinis overview of rule-based design models. Figure 1: Proof tree of the adjacency of two rooms in a DSL for architectural relations of space In earlier research by the author, as part of a bachelor thesis in Computing Science, this notion of a domain-specific language was tested on a different target: instead of focussing on bounding geometries, a formal syntax and semantics were formulated to describe relations between architectural spaces. Adjacency, containment and connectivity are specified in a formal grammar, and proof trees establish whether a given configuration satisfies a set of spatial constraints Fig. 1.1.3:1. In contrast to Alexanders verbal patterns, this DSL adheres to the specifications of formal languages in computer science. Its limitations, however, become immediately evident: even relatively simple declarations lead to a rapid combinatorial explosion in the proof trees, a direct consequence of the predicate-logic basis shared by such languages. The language is precise, but its very precision produces an opacity of its own. For the purposes of this thesis, the value of these formal and pattern-based approaches lies in the way they extend what counts as computable architectural content. Alexanders patterns encode social and spatial situations in textual form; shape grammars encode stylistic families as rule-based geometric transformations; the domain-specific language encodes spatial relations as logical predicates."}