{"created_at": 1766096075.135278, "confirmed": true, "origin": "searched", "search_input": "Methodologically, the work draws on computer science, mathematics and architectural theory to prototype alternative encodings and projections: algebraic rather than purely logicist; communicative rather than solely procedural. This stance situates architectural computation within a broader, contemporary paradigm of communication and self-organisation. The instrumentality of the thesis, writing as device, device as writing, follows a lineage of informational instruments that articulate libraries, images, and concepts into operable constellations developed at the Chair of Digital Architectonics at ETH in Zürich. The immediate concern is not to predict architecture from data, but to restore architectonic play between media: a space where theory, atmosphere, culture, and association can once again act with design.", "suggested_query": "ses on the material properties of the model, as the means to generate a new, operational register of relations between architectural thought and the digital. This operational register is not a mirror of the world, but an instrument for measuring the world, through which it can be re-read and re-written. The ambition here is to work towards the creation of a digital instrumentarium, where architectural processes are no longer solely the product of computation, but the result of the interaction between computation, text, and image. Through this approach, we can establish a new relation between architecture and the digital, one that is no longer solely driven by the desire for precise representation, but by the need to stage the registers through which architecture persists as culture, atmosphere, discourse, and discipline. We thus approach the digital model as an instrument that is capable of staging the registers of architectural thought, and that is capable of hosting the operations that make architectural communication relate across domains.", "suggest_context": "1.2 AMBITION But the arts of which we speak should, on the contrary, by means of numbers and relations of numbers, engender in us not a fable, but that hidden power which makes all fables. - Paul Valry, Dialogues The previous chapter 1.1 has outlined the challenge of facilitating architectural thought within the digital beyond geometrical encoding. The current geometry-forward digital 3D model is powerful, yet prone to monopolising architectural process by over-identifying architecture with its most readily computable register. The ambition here is to work from the opposite direction: to attend to the operations that make architectural communication relate across domains. What matters is not just what computation can represent and produce, but what information technologies can stage: how it can host the registers through which architecture persists as culture, atmosphere, discourse, and discipline. This thesis therefore explores how a manner of architectural thinking can be applied within the digital by cultivating an instrumented space of constant interaction, a sort of informational playground, where architectural processes remain active, and where modalities do not collapse into a single, sovereign axis. The aim is therefore not an other translation of architecture into data, but an architectural engagement with dominant digital modalities most insistently: text and image, treating their difference as a productive constraint rather than a gap to be aligned away. Bhlmanns reconstruction of Serres helps to fix the propositional stance. For Serres, models are not primarily representative or explanatory, but instrumental and operative: they realise a phenomenon and are themselves active, endowed with a kind of mentality or character. Models are not mirrors but devices: they create conditions under which relations can appear, be measured, and be transformed. Measurement still matters, but it may run along axes of probabilities, proximities, and indices, rather than along classical notions of correctness or exactitude. The ambition pursued here is to treat digital models in precisely this way: as architectonic instruments that facilitate reading, and re-reading, relations between heterogeneous communications. We treat the persistent difference between text and image as an architectonic obstacle that can structure thought, akin to the way perspective constructs a view by lawful distortion, always dependent on position. Throughout machine learning is relied on to establish projections between domains, with empha"}