{"created_at": 1764090067.48639, "confirmed": true, "origin": "zotero", "search_input": "And the inverse projection now using the figurative playground index presents these films as showing playground the most notably:", "suggested_query": "These films, as mentioned earlier, are those that are most relevant to the conversation topic of playground, and are presented as the most notable examples of films that show playground. Furthermore, the inverse projection using the figurative playground index presents these films as showing playground in a specific way, as if they are a representation of the playground itself. This raises questions about the role of the playground in these films and how it is being used as a representation of the playground. For instance, in The Florida Project, the playground is used as a symbol of childhood and innocence, whereas in Black Dog, it is used as a symbol of rebellion and nonconformity. In La Haine, the playground is used as a symbol of chaos and disorder.", "suggest_context": "So now let's have a look at what these projections are. Taking the 216 film corpus, they can be understood as how each film presents and distinguishes itself according to the conversations being had in it, amongst all of other films in the corpus. We already saw this as an outline in figure 3.4:9, but let's have a closer look at the contents. For instance the film Chunking Express by Wong Kar Wei distinguishes itself through the use of these words, and the corresponding projection shown in figure 3.5:1: pang, renovating, expiration, chi, recuperating, earliest, mandarin, harvested, sleepwalking, outdated, whirl, weepy, pineapple, shapeless, daydreaming, nabbed, comfy, jilted, karaoke, sliced, tat, shrewd, expire, salad, indulging, expired, cramp, observant, queasy, jog Figure 3.5:1 - Projection of Chunking Express onto the textual multi-modal screen click to open full scale image. For completeness we will also take a look at the inverse of this projection, a way of taking a view on which films are most relevant to a particular conversation topic. For instance conversations about playground are most notably held in: The Virgin Suicides - Sofia Coppola 1999, Reservoir Dogs - Quentin Tarantino 1992, Notes on a Scandal - Richard Eyre 2006, Porco Rosso - Hayao Miyazaki 1992, Ikiru - Akira Kurosawa 1952 text rightarrow text The next projection is one step down where we look at the internal projections within the text domain. This will give us an insight into how certain textual terms position themselves amongst other conversations. Vectorial operation is performed through a cosine similarity calculation between all wtF vectors, and the SOM is activated through a cosine similarity calculation between the wtF input and the vector of each cell. Taking playground again but this time to see in which contexts conversations about it are being held, we see it surrounds itself with: anticipated, recess, realised, patronise, complexion, lunching, extended, pressure, highway, leprechaun, lux, neighbourhood, burping, tipping, borderline, intersection, homecoming, hurricane, ballot, debutante, plumber, delicately, baked, kite, turbot, determination, yahoo, fungus, blackout Figure 3.5:2 - Projection of playground onto the textual multi-modal screen click to open full scale image. MULTIMODAL rightarrow text Now for the figurative counterpart we'll take the same examples, but instead we first project the film onto the figurative text, according to the signature f: F rightarrow wfF. Figure 3.5:2 - Projection of Chunking Express onto the figurative multi-modal screen click to open full scale image. And the inverse projection now using the figurative playground index presents these films as showing playground the most notably: The Florida Project - Sean Baker 2017, Black Dog - Guan Hu 2024, The Wire  S01E11 The Hunt - David Simon 2002, La Haine - Mathieu Kassovitz 1995, Attenberg - Athina Rachel Tsangari 2010 Do note that playground and playground do not have any pre-determined relation, anymore than two other indices, their possible correlation only comes from their presence within the domains and possible representation within the films. text rightarrow text"}