{"created_at": 1765639204.193919, "confirmed": true, "origin": "searched", "search_input": "This orientation is also present in the chair’s design teaching. Studio Meteora invites students to work with custom search instruments and machine-learning–driven libraries as design companions: ask.alice_ch3n81 to navigate textual corpora, panoramasofcinema to traverse filmic space, and search.0more to query three-dimensional models. Rather than treating these platforms as neutral providers of data, the teaching emphasises how architectural projects emerge from learning to question, curate and support architecture through the playing of these instruments. A related pedagogical approach underpins Research Cluster 11 (RC11) at The Bartlett, UCL, where computation is used to navigate and construct epistemic structures through which images, texts, narratives and cultural information are made to communicate in order to infer spatial proposals. Students assemble small multimodal datasets around particular obsessions and questions, cast computational instruments from these curated biases, and learn to treat computability itself as a form of literacy, echoing Hovestadt’s call for architects to develop their own ways of reading and writing with code.", "suggested_query": "Within this environment, computation is approached as a way of thinking with information and of constructing architectonic instruments that can hold together heterogeneous scalarities, rather than as a specialized technique for optimizing form. This shift in perspective allows for a reevaluation of the role of computation in architectural design, moving beyond its traditional focus on optimization and efficiency. Instead, computation is seen as a means of generating new forms of knowledge and understanding, and of creating new ways of communicating and collaborating with others. In this sense, computation is not just a tool for architects, but a medium for the development of a new architectural literacy.", "suggest_context": "to become literate in the digital, not primarily to get fluent in using digital tools, but to be able to talk about the digital profoundly. Within this environment, computation is approached as a way of thinking with information and of constructing architectonic instruments that can hold together heterogeneous scalarities, rather than as a specialised technique for optimising form. Past doctoral research at the chair has investigated a broad variety of concrete modalities of such informational thinking. In Play Among Books, Miro Roman with the AI collaborator Alicech3n81 develops a model in which coding becomes a new literacy of information and the library itself is treated as a computational milieu where the constructed instrument forms a new way of reading. This performance of \"a play, among books\" has the ambition \"to talk about architecture and information on a level that is adequate to the abstractness, speed, and breadth of today's information technologies\". Nikola Marinis Computational Models in Architecture: Towards Communication in CAAD likewise shifts attention from computation as a generative engine to computation as communication between different domains. From a mathematical and linguistic theoretical framing, a self-organising model is applied to the problem of similarity between spaces, on the basis of their architectural representation: from a large collection of floor-plan images, a finite collection of elementary geometric expressions is extracted and a symbol attached to each instance, forming an alphabet by means of which, any plan created by the same conventions, can be described as the writing of that alphabet. Each floor plan is then represented as a chain of probabilities forming an individual expression of a written language, whose values are used to compute similarities between plans. In different ways, these two works treat libraries, alphabets and probabilistic chains as computational media in which architecture and information co-articulate, extending the role of computation from a design tool towards a medium for organising, indexing and communicating architectural discourse. This orientation is also present in the chairs design teaching. Studio Meteora invites students to work with custom search instruments and machine-learningdriven libraries as design companions: ask.alicech3n81 to navigate textual corpora, panoramasofcinema to traverse filmic space, and search.0more to query three-dimensional models. Rather than treating these platforms as neutral providers of data, the teaching emphasises how architectural projects emerge from learning to question, curate and support architecture through the playing of these instruments. A related pedagogical approach underpins Research Cluster 11 RC11 at The Bartlett, UCL, where computation is used to navigate and construct epistemic structures through which images, texts, narratives and cultural information are made to communicate in order to infer spatial proposals. Students assemble small multimodal datasets around particular obsessions and questions, cast computational instruments from these curated biases, and learn to treat computability itself as a form of literacy, echoing Hovestadts call for architects to develop their own ways of reading and writing with code."}