{"created_at": 1764805626.188572, "confirmed": true, "origin": "searched", "search_input": "The regions are assembled to stage a scenography alongside the writing; not illustrations of it, but a backdrop and context. In practice, the prose navigates one textual field while, orthogonally, a visual field unfolds. This is our instrumented way of involving multiple domains while maintaining their differences. Serres, reading Leibniz, describes such contrapuntal analysis: *“Generally, the analysis is spun in such a way that several areas are involved at the same time: it is by this contrapuntal style that one recognises the master's pen. This makes us understand why the overall system is always the horizon of each analysis: through successive multivalences, we move towards the whole. The unilinearity of the writing itself is thus overcome.”.* The operative image we seek to establish in this context is not a Cartesian chain but a network: *\"since the image that Descartes and tradition have left us of their order is that of a chain, which concretises for the imagination the unity of progression and the connection of reasons, the image that imposes itself here is that of a network with several concurrent chains, which presents multiple \"entries\" and intersections: tapestry, weaving, embroidery or lace\"*. This is why our image lists prefer complementarity over sameness: each constellation is composed to hold together scenographically rather than repeat a single motif. Where Batia Suter's *Parallel Encyclopedia* traverses pictorial plenty through thematic clusters of depiction mediated by her personal observations, this setup approaches a collective visual reading via navigation by writing. As Suter notes on her method, *\"Coincidence is like an instrument that can be played\"*, which holds in our digital setup as well, where outcomes remain probabilistic rather than certain.", "suggested_query": "The image lists thus embody a tapestry, weaving together multiple concurrent chains of thought, with each constellation holding together scenographically rather than repeating a single motif. This approach to visual reading via navigation by writing allows for a collective reading experience, where the reader can navigate through the image lists and discover novel connections between the written and visual elements. In this way, the writing and images become intertwined, forming a rich and complex narrative that rewards close reading and exploration.", "suggest_context": "Figure 3.6:3 - Screenshot of 7 \"relevant word\" views of the image popup window. Figure 3.6:4 - Screenshot of the clicked word view on \"extracted\" of the image popup window, with the image labels that overlap with the query. Paragraph The second option is Paragraph. The signature is analogous: p rightarrow1 ptF rightarrow2 wfF rightarrow3 i The only difference being ptF instead of wtF: the writing is vectorised directly into the textual film space by fitting a TF-IDF matrix on the films subtitles and embedding p into that space with dimensionality corresponding to films. Because we do not differentiate words as inputs, we project ptF as a single vector onto the figurative domain; we then use all extracted regions from that activation as figurative sets for the image domain indexing regions by number. Each region marks a distinct figurative neighbourhood activated by the paragraph vector and yields its own image constellation. Figure 3.6:5 - Screenshot of 7 \"Paragraph\" views of the image popup window. Figure 3.6:6 - Screenshot of the clicked paragraph view on region 0 of the image popup window, with the image labels that overlap with the query. The regions are assembled to stage a scenography alongside the writing; not illustrations of it, but a backdrop and context. In practice, the prose navigates one textual field while, orthogonally, a visual field unfolds. This is our instrumented way of involving multiple domains while maintaining their differences. Serres, reading Leibniz, describes such contrapuntal analysis: Generally, the analysis is spun in such a way that several areas are involved at the same time: it is by this contrapuntal style that one recognises the master's pen. This makes us understand why the overall system is always the horizon of each analysis: through successive multivalences, we move towards the whole. The unilinearity of the writing itself is thus overcome.. The operative image we seek to establish in this context is not a Cartesian chain but a network: \"since the image that Descartes and tradition have left us of their order is that of a chain, which concretises for the imagination the unity of progression and the connection of reasons, the image that imposes itself here is that of a network with several concurrent chains, which presents multiple \"entries\" and intersections: tapestry, weaving, embroidery or lace\". This is why our image lists prefer complementarity over sameness: each constellation is composed to hold together scenographically rather than repeat a single motif. Where Batia Suter's Parallel Encyclopedia traverses pictorial plenty through thematic clusters of depiction mediated by her personal observations, this setup approaches a collective visual reading via navigation by writing. As Suter notes on her method, \"Coincidence is like an instrument that can be played\", which holds in our digital setup as well, where outcomes remain probabilistic rather than certain."}