{"created_at": 1765571208.697932, "confirmed": true, "origin": "searched", "search_input": "Koolhaas and Obrist underline that the Metabolists were *“a group of architects who saw their country and its transformation as a project,”* working together in a *“strategic alliance”* that mobilised *“a vast range of other disciplines,”* amplified by bureaucracy, business and media. Some protagonists would in fact become more influential in these arenas than through their built oeuvre, finding leverage in planning committees, expo organisations, advisory boards, broadcasting and even electoral politics. Their architectural thinking reappears there as spatial policy, national branding, and the programming of new publics rather than as singular objects. Kisho Kikutake describes the book Metabolism 1960 not as a single dogmatic statement but as *“a compilation of things we’d each done,”* more *“give and take about methodology than a declaration of principle,”* held together by critic Noboru Kawazoe, who asked *“what unique qualities and ideas Japan could bring to the world.”* In this view, the movement is less a closed manifesto than a platform for coordinated but heterogeneous experiments.", "suggested_query": "The Kunsthal's walls, too, are not just a neutral container for art, but an active participant in the communication of the project. They are not just a backdrop, but a texture that is woven into the narrative of the building and the city, as if the building itself were a story that is being told. The juxtaposition of cheap and expensive materials, of rough and smooth textures, of light and dark, creates a tension that is both spatial and narrative, a tension that is resolved in the moment of encounter, when the visitor steps into the space and becomes part of the story that is being told. The building's materiality is not just a neutral given, but a deliberate choice that is designed to create a particular atmosphere and mood, to create a sense of drama and tension that is both spatial and narrative.", "suggest_context": "The drawings thus establish a differentiation of communication rather than a single pictorial register: geometry is kept abstract and technical; art and landscape are given another kind of presence, scaled up to act as walls, figures or distant rooms. Even here, at the most pure edge of modernism, architecture is conceived and communicated through multiple modes at once, so that form appears as the result of operations that already exceed geometry. Referential contrasts Where Mies suspends art in a neutral frame, OMAs Kunsthal in Rotterdam begins from a relatively simple figure of ramps and halls but loads it with material contrasts that are as much economic and cultural as they are tactile. The official description of the building explicitly underlines the mix of expensive, classic materials such as marble and parquet with cheap, common materials such as corrugated plastic, bare concrete, galvanised steel gratings and rough tree trunks, noting that each exhibition space has its own character and atmosphere, use of material and format. The ramps and volumes are easily recoverable in a CAD model; what is harder to encode is this deliberate juxtaposition of welfare-state finishes and low-cost, almost provisional elements, and the way it turns the building into a section through different economic registers. Tibor Pataky describes how, from 1989 onwards, the binary character of the faades was blurred through an almost excessive diversification of materials, colours, and fenestrations, and how the project became a collage of largely autonomous screens, its structure and claddings diversified without technical necessity but as a conscious exaggeration of fragmentation. Figure 1.1.2:2 - Spread from S,M,L,XL, displaying one of the pages on the Kunsthal in Rotterdam. The image showing the space is not described or discussed; instead, it is accompanied by a narrative, a voice recounting events. This logic of contrast carries over into how the Kunsthal is communicated. In S,M,L,XL the project is unfolded in a sequence of spreads that read less like conventional documentation and more like a storyboard: fragments on Rotterdam as a city that makes no demands, the Museum Park as a chain of situations, and the Kunsthal as Life in the Box? are intercut with photographs and short textual episodes. Figure 1.1.2:2 is one of these: the lower hall facing the park appears as a pair of photos, grainy, fluorescent with rough tree-trunk columns, one colour the other black and white overlayed on top of the first. Overprinted with a narrative line: But in a single night!  I tell you we werent here yesterday. Another of your nightmares. It is dark, with a forest of five columns. The space is staged as an episode more than described as a type or analysed as a diagram. Geometry functions as the backdrop for a series of material, economic and narrative operations that script how the box can be read and inhabited, rather than as the primary bearer of the projects content."}