{"created_at": 1764949086.380555, "confirmed": true, "origin": "searched", "search_input": "Before turning towards what such an instrument might look like, we will first have a more in-depth discussion on the current state in which the digital hosts architecture. The dominant computational model in architecture currently falls within the category of a 3D CAD model, and in many practices especially that of the integrated BIM model. In turn these models mediate the other modes of architectural communication. They directly propagate plans, sections, renders and diagrams from which the idea of the architectural design is understood. In this condition the 3D model can be seen as a universal model that connects all representations. This connection is defined by means of the Cartesian coordinate system through linear projection, dictated by the axioms of Euclidean geometry. Euclidean geometry as defined in Euclid’s work *Elements* is presented as an abstraction of physical space, and as such was initially bound to 3 dimensions . *Elements*, historically an abstraction, thus effectively bound geometry to three dimensions; and through the CAD/BIM stacks prominent position of the digital platform for architecture, the discipline in turn inherits that encoding, even as mathematics has has long since generalised the axioms of *Elements* to n-dimensions. The Cartesian coordinate system serves as one means of an encoding of this space by being able to refer to specific points in space by means of a set of orthogonal coordinates, an alternative is for instance polar coordinates. The linear connection from 3D model to a plan, section or even render is calculated based on these orthogonal coordinates by projecting them onto a single plane. By connecting all models of communication, it could be argued that through the 3D model the architectural object has been internalised into the Cartesian system in its entirety. Singular, and with no abstraction, the architecture is internalised within computation. Further development in this direction is that of the digital twin, where the digital seeks to be identical to the physical manifestation of the architecture.", "suggested_query": "the internalization of the architecture within the Cartesian coordinate system raises questions about the relationship between the digital and the physical. Is the digital twin merely a reflection of the physical, or can it also be seen as a tool that can influence the physical manifestation of the architecture? This tension between the digital and the physical is reflected in the concept of the digital twin, where the digital seeks to be identical to the physical manifestation of the architecture.", "suggest_context": "1.1.1 THE MIRAGE OF THE DIGITAL TWIN Before turning towards what such an instrument might look like, we will first have a more in-depth discussion on the current state in which the digital hosts architecture. The dominant computational model in architecture currently falls within the category of a 3D CAD model, and in many practices especially that of the integrated BIM model. In turn these models mediate the other modes of architectural communication. They directly propagate plans, sections, renders and diagrams from which the idea of the architectural design is understood. In this condition the 3D model can be seen as a universal model that connects all representations. This connection is defined by means of the Cartesian coordinate system through linear projection, dictated by the axioms of Euclidean geometry. Euclidean geometry as defined in Euclids work Elements is presented as an abstraction of physical space, and as such was initially bound to 3 dimensions . Elements, historically an abstraction, thus effectively bound geometry to three dimensions; and through the CADBIM stacks prominent position of the digital platform for architecture, the discipline in turn inherits that encoding, even as mathematics has has long since generalised the axioms of Elements to n-dimensions. The Cartesian coordinate system serves as one means of an encoding of this space by being able to refer to specific points in space by means of a set of orthogonal coordinates, an alternative is for instance polar coordinates. The linear connection from 3D model to a plan, section or even render is calculated based on these orthogonal coordinates by projecting them onto a single plane. By connecting all models of communication, it could be argued that through the 3D model the architectural object has been internalised into the Cartesian system in its entirety. Singular, and with no abstraction, the architecture is internalised within computation. Further development in this direction is that of the digital twin, where the digital seeks to be identical to the physical manifestation of the architecture."}