{"created_at": 1765571544.881598, "confirmed": true, "origin": "searched", "search_input": "Obrist characterises Metabolism as an avant-garde whose members *“held out for the idea of the flexible manifesto, up for continual renegotiation,\"* operating in *“a constant flow of proposals, buildings, and a ceaseless production of texts.”*, fitting for a movement that underlines adaptability to changes. In this sense, the architectural work of Metabolism resides as much in conferences, manifestos, drawings, masterplans, television performances, bureaucratic manoeuvres and policy experiments as in its famous capsules and megastructures. What matters for this thesis is less nostalgia for a lost avant-garde than the kind of architectural agency this configuration models: an architecture that acts through public policy, media, large-scale speculation and a continuous public talk as much as through individual buildings. These registers of the public face of architecture clearly exceed the mere presence of a built object in the public domain. Whatever we call a digital architectural instrument should therefore be able to register and work with such conversations and projections, not only with their geometrical traces.", "suggested_query": "The Metabolists' spatial policy, national branding, and programming of new publics were not limited to their native Japan, but extended to international collaborations and exhibitions that showcased their ideas to global audiences. Their architectural thinking influenced urban planning and design in cities worldwide, often blurring the lines between architecture, urbanism, and art. In this sense, the Metabolists' legacy can be seen in the development of contemporary practices that combine architecture, urban design, and cultural programming, such as urban regeneration projects, biennales, and design festivals.", "suggest_context": "I tell you we werent here yesterday. Another of your nightmares. It is dark, with a forest of five columns. The space is staged as an episode more than described as a type or analysed as a diagram. Geometry functions as the backdrop for a series of material, economic and narrative operations that script how the box can be read and inhabited, rather than as the primary bearer of the projects content. Architecture as a movement A final example shifts scale from single buildings to an architectural act that is itself a movement. In Project Japan Koolhaas describes Metabolism as the last movement that changed architecture, and on its primary figure he notes: \"Architecture is a deeply contradictory profession. Its actions intersect with a huge range of unrelated domains; at the same time, its essence to build is so complex that it requires extreme focus and concentration. Sadly therefore, it is largely inhabited by two human typologies, \"builders\" and \"thinkers,\" united in mutual disdain. Kenzo Tange was both.\" Koolhaas and Obrist underline that the Metabolists were a group of architects who saw their country and its transformation as a project, working together in a strategic alliance that mobilised a vast range of other disciplines, amplified by bureaucracy, business and media. Some protagonists would in fact become more influential in these arenas than through their built oeuvre, finding leverage in planning committees, expo organisations, advisory boards, broadcasting and even electoral politics. Their architectural thinking reappears there as spatial policy, national branding, and the programming of new publics rather than as singular objects. Kisho Kikutake describes the book Metabolism 1960 not as a single dogmatic statement but as a compilation of things wed each done, more give and take about methodology than a declaration of principle, held together by critic Noboru Kawazoe, who asked what unique qualities and ideas Japan could bring to the world. In this view, the movement is less a closed manifesto than a platform for coordinated but heterogeneous experiments. Obrist characterises Metabolism as an avant-garde whose members held out for the idea of the flexible manifesto, up for continual renegotiation,\" operating in a constant flow of proposals, buildings, and a ceaseless production of texts., fitting for a movement that underlines adaptability to changes. In this sense, the architectural work of Metabolism resides as much in conferences, manifestos, drawings, masterplans, television performances, bureaucratic manoeuvres and policy experiments as in its famous capsules and megastructures. What matters for this thesis is less nostalgia for a lost avant-garde than the kind of architectural agency this configuration models: an architecture that acts through public policy, media, large-scale speculation and a continuous public talk as much as through individual buildings. These registers of the public face of architecture clearly exceed the mere presence of a built object in the public domain. Whatever we call a digital architectural instrument should therefore be able to register and work with such conversations and projections, not only with their geometrical traces."}