{"created_at": 1762558787.366296, "confirmed": true, "origin": "zotero", "search_input": "The current version of the text editor facilitates a constant movement between text onto itself, as well as text onto imagery, with further granularity to show where these projections derive from through the reveal of films. The other two movements from imagery onto itself as well as imagery onto text are capable within the architecture of the editor, but have not been included in the active version, but are instead facilitated through standalone jupyter notebooks. After all, the primary activity the interactive editor is to facilitate is the *writing* of this thesis, however we will later visit how a *picturing* of a text can be explored through this instrument as well.", "suggested_query": "4. With this interactive text editor, the user can navigate through different modes, from text editing to visual representation, and vice versa. This constant movement between modes allows for a more dynamic and iterative writing process, where ideas can be explored and developed in a non-linear fashion. The user can switch between modes seamlessly, allowing for a deeper understanding of the relationships between text and imagery. For instance, a user may start by writing a paragraph of text, and then switch to the visual representation mode to see how the text can be rearranged or reorganized to better convey their ideas. This interplay between text and imagery can lead to new insights and perspectives, and ultimately, a more refined and cohesive thesis.", "suggest_context": "3. TEXT EDITOR Companions: The Writing Images and Picturing Text editor WIPTe forms the primary subject of this thesis, as well as its operation and context. The primary focus in constructing this multi-modal instrument together is to facilitate a constant setting within which this thesis is to be written. Therefore turning on itself both as an outline of what it is proposing as a research direction, all the time whilst demonstrating the outcome of its own question, simultaneaously. Therefore it was deemed of importance that WIPT was finished before the final writing stage. This chapter will go through all of the steps of its implementation, whilst continuing to be accompanied by the imagery and textual contexts it puts forward. The current version of the text editor facilitates a constant movement between text onto itself, as well as text onto imagery, with further granularity to show where these projections derive from through the reveal of films. The other two movements from imagery onto itself as well as imagery onto text are capable within the architecture of the editor, but have not been included in the active version, but are instead facilitated through standalone jupyter notebooks. After all, the primary activity the interactive editor is to facilitate is the writing of this thesis, however we will later visit how a picturing of a text can be explored through this instrument as well."}