{"created_at": 1766097497.458472, "confirmed": true, "origin": "searched", "search_input": "If something is put through computation, with the Turing machine as the archetypical machine, it must be encoded. Represented as 1s and 0s. Flattened into the binary. This however does not *necessarily* mean the artefact is flattened in itself; the flattening becomes an issue when the encoding is treated as a definition of the object. This could be the case with the 3D model and the digital twin if architecture is presumed to have *become* the model, totally represented through its geometric and informational surrogate. In the same fashion, any one perspective image through Alberti’s technics of perspective becomes, in its communication, a flattened index. But the art of architecture is that the comprehension of space exists through the proportion between different modes of communication. This is also why Ada Lovelace remains a key reference point. Her insight for the potential of numerical encoding to offer another space to think in. One that remains an instrument, but not a predetermined one. The thesis keeps the binary substrate (1s and 0s) in view as an addressing system: a condition for operations.", "suggested_query": "The editor, a tool of research, is itself an architectural project in the making, as it is designed to facilitate the negotiation between heterogeneous modes of information and contents. This editor, an instrument of thought, is thus the site where the thesis is not only written but also tested, refined, and rewritten as a continuous process of refinement. In this sense, the thesis is not a static document but a dynamic system of thought that is constantly evolving, incorporating new information and adapting to new situations.", "suggest_context": "1.2.1 SCOPE The scope of this thesis is to apply an architectural attitude to digital information. This means the thesis is not so much directly engaging with architecture as an object, but rather with the processes that lie at the basis of architectural projects: how architecture thinks, communicates, and negotiates between heterogeneous modes. The project pursues architectural method as a transferable discipline of mediation, an art of placing different information and contents into proportion. Because the research is pursued through an instrument developed alongside it, the scope revolves around the design of an editor in which the thesis is written and tested as an operational environment, with the theoretical argumentation supporting the reasoning for this stance. The work therefore treats writing itself, and to lesser extent the curation of image constellations, as modes of architectonic operation: a back-and-forth between domains of texts and images, actively handled, queried, projected, and recomposed as part of the research procedure."}