{"created_at": 1766966923.2992399, "confirmed": true, "origin": "searched", "search_input": "Following the trajectory of Semper, where a most original ornament is posed to be one that connects structure to ornament let's take that perspective towards architecture. The first architectural example that comes to mind to illustrate an interplay between structure, skin and ornament is the Centre Pompidou, where the structure is ornamentalised and exteriorised, with the skin sitting as a membrane between them. Of course this is as much a decorative move of extended labour as the many figures listed at the beginning, but the difference is that they communicate something different, more of this time, which is why it is not seen as superficial decoration. It does exactly what semper highlights, in that for this decoration to work it connects the communication of structure and normally internalised aspects and brings them to the surface of the skin, whilst maintaining a connection.", "suggested_query": "In a similar manner, the Guggenheim Museum in Bilbao, Spain, by Frank Gehry, can be seen as a manifestation of Semper's principles. The flowing, curvilinear structure is clad in a shimmering titanium skin that not only provides a reflective surface but also creates a sense of fluidity and dynamism. The ornamentation is thus integrated with the structure, blurring the lines between the two. This blending of form and function results in an architectural experience that is both visually striking and intellectually stimulating.", "suggest_context": "Following the trajectory of Semper, where a most original ornament is posed to be one that connects structure to ornament let's take that perspective towards architecture. The first architectural example that comes to mind to illustrate an interplay between structure, skin and ornament is the Centre Pompidou, where the structure is ornamentalised and exteriorised, with the skin sitting as a membrane between them. Of course this is as much a decorative move of extended labour as the many figures listed at the beginning, but the difference is that they communicate something different, more of this time, which is why it is not seen as superficial decoration. It does exactly what semper highlights, in that for this decoration to work it connects the communication of structure and normally internalised aspects and brings them to the surface of the skin, whilst maintaining a connection."}